
class mouth {
    String s1 =
        "سرطان الفم :هو ورم خبيث ينشأ على اللثة او تجويف الفم يعرف بأنه سرطان الخلايا الحرشفيه ويحدث عند الرجال اكثر من النساء, قد يظهر سرطان الفم على:";
    String s2 =
        "1- اللسان.\n2- الشفتين. \n3- قاع الفم (أسفل اللسان). \n4- بطانة الخدين الداخلية.\n5- اللثة. \n6- سقف الفم.\n7- الأنسجة الرخوه.";
    String s3 =
        "ولكن سرطان الفم يحدث بشكل اكبر على اللسان وفي قاع الفم (أسفل اللسان).";
    String s4 =
        "1- انتفاخ يتبعه ألم ونزيف وقلة حركة باللسان والتنميل (الخدران).\n2 -صعوبة في الكلام.\n3- صعوبة في البلع.\n4- ألم اثناء البلع.\n5- تغيير في الصوت.\n6- ألم في الأذن.";
    String s5= "1- التدخين \nأن التبغ بأشكاله المختلفة منها التدخين والمضغ لها تأثير مسرطن في تجويف الفم. "
        "التدخين هو الشكل الأكثر شيوعا لتعاطي التبغ , الأشكال التي يستخدم فيها التبغ كدخان هي السجائر , السيجار , الأنابيب , الأرجيلة . ";
    String s6= "2- الكحول\n يتسبب الكحول في الإصابة بسرطان الفم."
        "تعتبر المشروبات الكحولية مسببة للسرطان وتسبب بشكل خاص أورام تجويف الفم والبلعوم والحنجرة والمريء والكبد .";
    String s7= "أسناننا من أكثر أعضاء أجسامنا صالبة ، وهي مغلفة بطبقة المينا"
     " التي تحتوي على الحد الاقصى لنسبة المعادن."
    " هل هذا يعني أن أسناننا غير قابلة للكسر وما هي اسباب تكسر الاسنان ؟"
    " حسنًا، الجواب ”لا “، قد تنكسر أسناننا وقد يمر بعضنا بتجربة الأسنان المكسورة .";
    String s8= "هو كسر في القشرة الصلبة الخارجية للسن التي تسمى (المينا). التي تحمي اللب الداخلي الأكثر ليونة الذي يحتوي على أعصاب وأوعية دموية.";
    String s9= "أصبحت إصابات الأسنان الآن قضية صحية رائدة بسبب انتشارها الكبير وتأثيرها الكبير على أنشطة الأطفال. قد يؤدي هذا إلى عدم الراحة الجسدية والألم والتأثيرات النفسية الأخرى مثل الميل إلى الابتعاد عن الضحك أو الابتسام ، مما قد يؤثر على تفاعلاتهم الاجتماعية."
        "قد تؤدي اصابه الاسنان إلى تلون أو تشوه أو خسارة محتمله للسن نفسه.";
    String s10= "1- السقوط أثناء اللعب حساب لمزيد من الإصابات \n"
    "2- الأطفال الذين يمارسون الرياضات التي تتطلب الاحتكاك الجسدي هم أكبر خطر لإصابات الأسنان. \n"
    "3- مضغ الأطعمة الصلبة مثل (المكسرات، وحبات الفشار وغيرها من األطعمة الصلبه)."
    "\n4- استخدام الخاطئ للأسنان مثل (استخدام الاسنان كأداة لفتح عبوات المشروبات الغازي)."
    "\n5- الشد أو الضغط على الأسنان اثناء النوم."
    "\n6- حوادث السيارات سبب كبير إصابات المراهقين."
    "\n7- الأطفال الذين يعانون من سوء الأطباق النوع الثاني هم أكثر عرضة للإصابة بالأسنان."
    "\n8- الأطفال الذين يعانون من اضطرابات النوبات المزمنة مثل مرضى الصرع."
    "\n9- إساءة معاملة الأطفال.";
    String s11= "وتختلف إصابات الأسنان الناتجة وتشمل من الأبسط إلى الأكثر تعقيداً : ";
    String s12= "• ارتجاج السن (Concussion-A)."
    "\n• كسر بتاج السن وقد يكون بسيطاً يشمل جزءاً من المينا أو قد يمتد ليشمل العاج واللب وأحياناً كسر لتاج السن بأكمله (E-C- detacilpmocnu dna detacilpmoc erutcarF nworC)."
    "\n• انغراس السن للداخل أو اندفاع السن خارج العظم (Intrusion or Extrusion-F-C)."
    "\n• كسر بجذر السن (Root Fracture-H)."
    "\n• سقوط السن (Avulsion-I).";
    String s13=" 1- ضع ثلجا أو قطعة قماش باردة على منطقة اللثة أوالخد لتخفيف الألم والتورم ، ولكن في حالة تكشف، تعرض العصب أو لب السن ، فتجنب وضع أي شيء شديد السخونة أو البرودة بالقرب من السن حتى تراجع طبيب الأسنان."
   "\n 2- استشارة الطبيب عن إمكانية تناول مسكنات الألم التي لا تستلزم وصفة طبية."
   "\n 3-  تناول المضادات الحيوية التي يصفها الطبيب، ويجب أن تلتزم بالمدة العلاجية كاملة ولا تتوقف عن تناولها لمجرد أنك تشعر بتحسن."
   "\n 4- غسل الفم بمحلول الماء الدافئ والملح بعد الوجبات مباشرة للمساعدة في الشفاء."
   "\n 5- تناول الأطعمة الطرية التي يسهل مضغها."
   "\n 6- تجنب الأطعمة التي قد تسبب اللسع ، مثل: الأطعمة المالحة أو الحارة والفواكه الحمضية والطماطم."
   "\n 7- الإقلاع عن التدخين لأنه يبطئ الشفاء."
   "\n 8- احرص على تنظيف أسنانك برفق بالفرشاة مرتين على الأقل يوميا واستخدام الخيط مرة واحدة يوميا على الأقل.";
    String s14="- تركيب قشرة veneer. \n- تركيب طربوش او حشو العصب زراعة للأسنان .";
    String s15="* شطف الفم بالماء لتنظيف المنطقة براحة . "
    "\n* احتفظ بأي جزء من السن المكسور لإمكانية اعادة ربطها ."
    "\n* ضع السن المكسور في كاس من الحليب أو لعاب الشخص المهم ابقاؤه في مكان رطب ."
    "\n* في حالة حدوث نزيف ، يتم العض على قطعة شاش مبللة بماء بارد ، واستمر في الضغط حتى يتوقف النزيف و يخف الألم."
    "\n* اذهب إلى أقرب طبيب أسنان للأطفال.";
    String s16="الاختيار الأمثل هو استخدام فرشاة أسنان تكون متوسطة الخشونة Medium Bristles Tooth Brush وهذا ( في حالة عدم وجود نزيف في اللثة ) أما في حال وجود انحسار في اللثة أو نزيف في اللثة ف سيكون الافضل هو استخدام فرشاة أسنان ناعمة (Soft Bristle Tooth Brush) "
    "استخدام الفرشاة الخشنة (Hard Bristles Tooth Brush) "
    "أصبح شبه محضور لأنها يمكن أن تلحق الضرر باللثة وسطح الجذر ومينا الأسنان. كما أنه يتم تعليم المريض الـطريقة المناسبة حسب الوضع الصحي للمريض ووضع اللثة والأسنان .";
    String s17="هذه الطريقة الاعتيادية الواجب تعليمها للمرضى ممن لا يعانون من مشاكل صحية، لا يضعون تقويم الاسنان أو تركيب متحرك، والأهم أنهم لا يعانون من مشاكل باللثة.";
    String s18="* أولا: ضع الفرشاة بزاوية 45 درجة على سطح السن الأمامي يجب أن تلامس الشعيرات كلا من الأسنان واللثة."
    "\n* ثانيا: حرك الفرشاة بحركة دائرية صغيرة تهتز. "
    "\n* ثالثا: نظف السطح الداخلي للأسنان الخلفية بتحريك الفرشاة بحركة صغيرة ذهابًا وإيابًا. "
    "\n*رابعا: نظف السطح الداخلي للأسنان العلوية الأمامية بإمالة الفرشاة رأسياً باستخدام ضربات صغيرة لأعلى ولأسفل. "
    "\n*خامسا: نظف السطح الداخلي للأسنان الأمامية السفلية بإمالة الفرشاة رأسياً باستخدام ضربات صغيرة لأعلى ولأسفل. "
    "\n*سادسا: حرك الفرشاة في حركة ذهابًا وإيابًا لتنظيف أسطح القضم. ";
    String s19="*الخطوة الأولى: ضع فرشاة أسنانك بزاوية 45 درجة على لثتك ونظف الأسنان بحركة دائريه اهتزازيه حول اللثة لمده ١٠ ثوان على كل سن.\n*الخطوة الثانية: قم بتوجيهها بحيث تزيل البلاك من فوق الأقواس وسلك القوس.\n*الخطوة الثالثة: أغسل الأسطح الخارجية والداخلية والمضغية لكل سن.\n*الخطوة الرابعة: استخدم طرف الفرشاة للسطح الداخلي لأسنانك الأمامية.";
    String s20="يجب أن تغطي نصف الشعيرات اللثة والنصف الآخر يجب أن يكون على سطح السن. عن طريق القيام بحركات أفقية قصيرة وخفيفة ، تتم إزالة البلاك من فوق خط اللثة. تساعد هذه الحركات على إزالة البلاك وتنشيط اللثة. يمكن عمل مجموعات صغيرة فقط من الأسنان في كل مرة, بمجرد اكتمال المنطقة ، انتقل إلى المجموعة التالية من الأسنان.";
    String s21="هذه التقنية سهلة التعلم وتوفر تحفيزًا جيدًا للثة. في هذه التقنية ، توضع الفرشاة على مجموعة من الأسنان وتحرك في حركة دائرية 4-5 مرات لكل مجموعة أسنان. يتم الاحتفاظ بالأسنان العلوية والسفلية في وضع مغلق أثناء إجراء تقنية التنظيف بالفرشاة.";
    String s22="خيط الأسنان: هو خيط مكون من مجموعة من الخيوط الرفيعة، ويستخدم لإزالة بقايا الطعام واللويحات السنية الموجودة الاسنان، وذلك في المناطق التي يصعب على فرشاة الأسنان الوصول اليها. ";
    String s23="1. تنظيف الأسنان بفعالية عالية.\n2. حماية اللثه.\n3. توفير المال.\n4. الوقايه من امراض اخرى.\n5. منع تراكم الجير.\n6. سهل الاستخدام.";
    String s24="1. قطع قطعة من الخيط مع طول لا يقل عن 30 سم.\n2.لفة كل نهاية من الخيط في إصبع القلب من كل يد، وعقد الخيط مع أصابع الفهرس والإبهام لتحسين السيطرة.\n3.تمرير الخيط من خلال الفضاء بيناتية الأولى، مما يجعل حركة يتأرجح لتنظيف الأسنان تماما.\n( يستخدم مره يوميا ع الاقل) ";
    String s25="- نزيف اللثة. \n- حساسية اللثة. \n- ضعف مينا الأسنان، مما يجعلها عرضة للتآكل على المدى الطويل. \n- العدوى، نتيجة لدخول البكتيريا الموجودة في تجويف الفم إلى مجرى الدم عبر جروح اللثة.";
}

