class mouth {
  String s1 =
      "هو ورم خبيث ينشأ على اللثة او تجويف الفم يعرف بأنه سرطان الخلايا الحرشفيه ويحدث عند الرجال اكثر من النساء, قد يظهر سرطان الفم على:";
  String s2 =
      "1- اللسان.\n2- الشفتين. \n3- قاع الفم (أسفل اللسان). \n4- بطانة الخدين الداخلية.\n5- اللثة. \n6- سقف الفم.\n7- الأنسجة الرخوه.";
  String s3 =
      "ولكن سرطان الفم يحدث بشكل اكبر على اللسان وفي قاع الفم (أسفل اللسان).";
  String s4 =
      "1- انتفاخ يتبعه ألم ونزيف وقلة حركة باللسان والتنميل (الخدران).\n2 -صعوبة في الكلام.\n3- صعوبة في البلع.\n4- ألم اثناء البلع.\n5- تغيير في الصوت.\n6- ألم في الأذن.";
  String s5 =
      "1- التدخين \nأن التبغ بأشكاله المختلفة منها التدخين والمضغ لها تأثير مسرطن في تجويف الفم. "
      "التدخين هو الشكل الأكثر شيوعا لتعاطي التبغ , الأشكال التي يستخدم فيها التبغ كدخان هي السجائر , السيجار , الأنابيب , الأرجيلة . ";
  String s6 = "2- الكحول\n يتسبب الكحول في الإصابة بسرطان الفم."
      "تعتبر المشروبات الكحولية مسببة للسرطان وتسبب بشكل خاص أورام تجويف الفم والبلعوم والحنجرة والمريء والكبد .";
  String s7 = "أسناننا من أكثر أعضاء أجسامنا صالبة ، وهي مغلفة بطبقة المينا"
      " التي تحتوي على الحد الاقصى لنسبة المعادن."
      " هل هذا يعني أن أسناننا غير قابلة للكسر وما هي اسباب تكسر الاسنان ؟"
      " حسنًا، الجواب ”لا “، قد تنكسر أسناننا وقد يمر بعضنا بتجربة الأسنان المكسورة .";
  String s8 =
      "هو كسر في القشرة الصلبة الخارجية للسن التي تسمى (المينا). التي تحمي اللب الداخلي الأكثر ليونة الذي يحتوي على أعصاب وأوعية دموية.";
  String s9 =
      "أصبحت إصابات الأسنان الآن قضية صحية رائدة بسبب انتشارها الكبير وتأثيرها الكبير على أنشطة الأطفال. قد يؤدي هذا إلى عدم الراحة الجسدية والألم والتأثيرات النفسية الأخرى مثل الميل إلى الابتعاد عن الضحك أو الابتسام ، مما قد يؤثر على تفاعلاتهم الاجتماعية."
      "قد تؤدي اصابه الاسنان إلى تلون أو تشوه أو خسارة محتمله للسن نفسه.";
  String s10 = "1- السقوط أثناء اللعب حساب لمزيد من الإصابات \n"
      "2- الأطفال الذين يمارسون الرياضات التي تتطلب الاحتكاك الجسدي هم أكبر خطر لإصابات الأسنان. \n"
      "3- مضغ الأطعمة الصلبة مثل (المكسرات، وحبات الفشار وغيرها من األطعمة الصلبه)."
      "\n4- استخدام الخاطئ للأسنان مثل (استخدام الاسنان كأداة لفتح عبوات المشروبات الغازي)."
      "\n5- الشد أو الضغط على الأسنان اثناء النوم."
      "\n6- حوادث السيارات سبب كبير إصابات المراهقين."
      "\n7- الأطفال الذين يعانون من سوء الأطباق النوع الثاني هم أكثر عرضة للإصابة بالأسنان."
      "\n8- الأطفال الذين يعانون من اضطرابات النوبات المزمنة مثل مرضى الصرع."
      "\n9- إساءة معاملة الأطفال.";
  String s11 =
      "وتختلف إصابات الأسنان الناتجة وتشمل من الأبسط إلى الأكثر تعقيداً : ";
  String s12 = "• ارتجاج السن (Concussion-A)."
      "\n• كسر بتاج السن وقد يكون بسيطاً يشمل جزءاً من المينا أو قد يمتد ليشمل العاج واللب وأحياناً كسر لتاج السن بأكمله (E-C- detacilpmocnu dna detacilpmoc erutcarF nworC)."
      "\n• انغراس السن للداخل أو اندفاع السن خارج العظم (Intrusion or Extrusion-F-C)."
      "\n• كسر بجذر السن (Root Fracture-H)."
      "\n• سقوط السن (Avulsion-I).";
  String s13 =
      " 1- ضع ثلجا أو قطعة قماش باردة على منطقة اللثة أوالخد لتخفيف الألم والتورم ، ولكن في حالة تكشف، تعرض العصب أو لب السن ، فتجنب وضع أي شيء شديد السخونة أو البرودة بالقرب من السن حتى تراجع طبيب الأسنان."
      "\n 2- استشارة الطبيب عن إمكانية تناول مسكنات الألم التي لا تستلزم وصفة طبية."
      "\n 3-  تناول المضادات الحيوية التي يصفها الطبيب، ويجب أن تلتزم بالمدة العلاجية كاملة ولا تتوقف عن تناولها لمجرد أنك تشعر بتحسن."
      "\n 4- غسل الفم بمحلول الماء الدافئ والملح بعد الوجبات مباشرة للمساعدة في الشفاء."
      "\n 5- تناول الأطعمة الطرية التي يسهل مضغها."
      "\n 6- تجنب الأطعمة التي قد تسبب اللسع ، مثل: الأطعمة المالحة أو الحارة والفواكه الحمضية والطماطم."
      "\n 7- الإقلاع عن التدخين لأنه يبطئ الشفاء."
      "\n 8- احرص على تنظيف أسنانك برفق بالفرشاة مرتين على الأقل يوميا واستخدام الخيط مرة واحدة يوميا على الأقل.";
  String s14 =
      "- تركيب قشرة veneer. \n- تركيب طربوش او حشو العصب زراعة للأسنان .";
  String s15 = "* شطف الفم بالماء لتنظيف المنطقة براحة . "
      "\n* احتفظ بأي جزء من السن المكسور لإمكانية اعادة ربطها ."
      "\n* ضع السن المكسور في كاس من الحليب أو لعاب الشخص المهم ابقاؤه في مكان رطب ."
      "\n* في حالة حدوث نزيف ، يتم العض على قطعة شاش مبللة بماء بارد ، واستمر في الضغط حتى يتوقف النزيف و يخف الألم."
      "\n* اذهب إلى أقرب طبيب أسنان للأطفال.";
  String s16 =
      "الاختيار الأمثل هو استخدام فرشاة أسنان تكون متوسطة الخشونة Medium Bristles Tooth Brush وهذا ( في حالة عدم وجود نزيف في اللثة ) أما في حال وجود انحسار في اللثة أو نزيف في اللثة ف سيكون الافضل هو استخدام فرشاة أسنان ناعمة (Soft Bristle Tooth Brush) "
      "استخدام الفرشاة الخشنة (Hard Bristles Tooth Brush) "
      "أصبح شبه محضور لأنها يمكن أن تلحق الضرر باللثة وسطح الجذر ومينا الأسنان. كما أنه يتم تعليم المريض الـطريقة المناسبة حسب الوضع الصحي للمريض ووضع اللثة والأسنان .";
  String s17 =
      "هذه الطريقة الاعتيادية الواجب تعليمها للمرضى ممن لا يعانون من مشاكل صحية، لا يضعون تقويم الاسنان أو تركيب متحرك، والأهم أنهم لا يعانون من مشاكل باللثة.";
  String s18 =
      "* أولا: ضع الفرشاة بزاوية 45 درجة على سطح السن الأمامي يجب أن تلامس الشعيرات كلا من الأسنان واللثة."
      "\n* ثانيا: حرك الفرشاة بحركة دائرية صغيرة تهتز. "
      "\n* ثالثا: نظف السطح الداخلي للأسنان الخلفية بتحريك الفرشاة بحركة صغيرة ذهابًا وإيابًا. "
      "\n*رابعا: نظف السطح الداخلي للأسنان العلوية الأمامية بإمالة الفرشاة رأسياً باستخدام ضربات صغيرة لأعلى ولأسفل. "
      "\n*خامسا: نظف السطح الداخلي للأسنان الأمامية السفلية بإمالة الفرشاة رأسياً باستخدام ضربات صغيرة لأعلى ولأسفل. "
      "\n*سادسا: حرك الفرشاة في حركة ذهابًا وإيابًا لتنظيف أسطح القضم. ";
  String s19 =
      "*الخطوة الأولى: ضع فرشاة أسنانك بزاوية 45 درجة على لثتك ونظف الأسنان بحركة دائريه اهتزازيه حول اللثة لمده ١٠ ثوان على كل سن.\n*الخطوة الثانية: قم بتوجيهها بحيث تزيل البلاك من فوق الأقواس وسلك القوس.\n*الخطوة الثالثة: أغسل الأسطح الخارجية والداخلية والمضغية لكل سن.\n*الخطوة الرابعة: استخدم طرف الفرشاة للسطح الداخلي لأسنانك الأمامية.";
  String s20 =
      "يجب أن تغطي نصف الشعيرات اللثة والنصف الآخر يجب أن يكون على سطح السن. عن طريق القيام بحركات أفقية قصيرة وخفيفة ، تتم إزالة البلاك من فوق خط اللثة. تساعد هذه الحركات على إزالة البلاك وتنشيط اللثة. يمكن عمل مجموعات صغيرة فقط من الأسنان في كل مرة, بمجرد اكتمال المنطقة ، انتقل إلى المجموعة التالية من الأسنان.";
  String s21 =
      "هذه التقنية سهلة التعلم وتوفر تحفيزًا جيدًا للثة. في هذه التقنية ، توضع الفرشاة على مجموعة من الأسنان وتحرك في حركة دائرية 4-5 مرات لكل مجموعة أسنان. يتم الاحتفاظ بالأسنان العلوية والسفلية في وضع مغلق أثناء إجراء تقنية التنظيف بالفرشاة.";
  String s22 =
      "خيط الأسنان: هو خيط مكون من مجموعة من الخيوط الرفيعة، ويستخدم لإزالة بقايا الطعام واللويحات السنية الموجودة الاسنان، وذلك في المناطق التي يصعب على فرشاة الأسنان الوصول اليها. ";
  String s23 =
      "1. تنظيف الأسنان بفعالية عالية.\n2. حماية اللثه.\n3. توفير المال.\n4. الوقايه من امراض اخرى.\n5. منع تراكم الجير.\n6. سهل الاستخدام.";
  String s24 =
      "1. قطع قطعة من الخيط مع طول لا يقل عن 30 سم.\n2.لفة كل نهاية من الخيط في إصبع القلب من كل يد، وعقد الخيط مع أصابع الفهرس والإبهام لتحسين السيطرة.\n3.تمرير الخيط من خلال الفضاء بيناتية الأولى، مما يجعل حركة يتأرجح لتنظيف الأسنان تماما.\n( يستخدم مره يوميا ع الاقل) ";
  String s25 =
      "- نزيف اللثة. \n- حساسية اللثة. \n- ضعف مينا الأسنان، مما يجعلها عرضة للتآكل على المدى الطويل. \n- العدوى، نتيجة لدخول البكتيريا الموجودة في تجويف الفم إلى مجرى الدم عبر جروح اللثة.";
  String res =
      "_1Rivera C. Essentials of oral cancer. International journal of clinical and experimental pathology. 2015;8(9):11884.";
}

class Nice {
  String s1="الأسنان والابتسامة هي عنوان كل شخص، لذلك يبحث العديد من الأشخاص عن طرق وأساليب للحصول على أسنان جميلة، وأتاح لنا مجال طب الأسنان التجميلي الكثير من المجالات لطرق الذي تساعد على الحصول على أسنان جميلة وطب الأسنان التجميلي يعتبر من أهم أنواع الطب الذي يستخدم في علاج أمراض الأسنان والفم، للحفاظ عليهم بصحة جيدة، ويعمل علي تحسين مظهر الفم الداخلي والخارجي، فهو يساهم في ظهور الفم بشكل لائق يجذب له الأنظار..";
  String s2="هو من وسائل طب الأسنان التجميلي، ويقصد به التغلب على مشكلة تلون الأسنان غير الطبيعي، ويختلف تلون الأسنان تبعا للأسباب المؤدية لحدوثه. والتلون نوعان؛ السطحي (الخارجي) والداخلي.";
  String s3="1. التبييض بالليزر في عيادة الأسنان هو أسرع وسائل تبييض الاسنان، حيث يتم إجراؤه في جلسة واحده ولا يحتاج إلى التخدير، ولكن هذا النوع يزيد احتمالية الإصابة بحساسية الاسنان.";
  String s4="2. القوالب المنزلية :\n- قالب مخصص : يقوم طبيب الأسنان بأخذ نموذج من الاسنان (طبعه للأسنان) ويتم تصنيع قالب مناسب بحيث لا يلامس اللثة، ويتم ارتداؤه على الأسنان لمدة ٦ ساعات وتعتمد المدة اللازمه لارتداء القالب على احتياجات الشخص وتوصيات طبيب الأسنان.\n\n• القالب الجاهز : يمكن شراؤه من الصيدليات، وغالبًا ما يصاحبه سائل يعمل على تسريع التبييض؛ حيث يوضع على الأسنان مباشرة قبل وضع القالب المحتوي على جل التبييض، ويأتي القالب بحجم واحد للجميع يتم ارتداؤه على الأسنان لمدة تراوح بين ٥ دقائق و٣٠ دقيقة، وللحصول على أفضل النتائج، فإنه يتم الاستمرار في استخدامه لمدة ١٠ أيام إلى ١٤ يومًا.";
  String s5="3. شرائط التبييض اللاصقة (لصقات الأسنان) : تتوفر دون وصفة طبية، وبكل مرة يتم إلصاق شريط على الأسنان مباشرة، ثم التخلص منه بعد انتهاء المدة المحددة باليوم (٣٠ دقيقة تقريبًا)، لذلك تعد وسيلة أنظف وأسهل استخدامًا من القوالب.";
  String s6="• بعض الأطعمة ذات الصبغات القوية مثل: التوت والكرز.\n• بعض المشروبات مثل: الشاي والقهوة.\n• تكون الجير والبلاك والترسبات الأخرى.\n• حدوث ضربة أو إصابة في الفم.\n• التدخين.\n• ضعف طبقة مينا الأسنان بسبب الشيخوخة.\n• بعض الأدوية مثل المضادات الحيوية.";
  String s7="• تهيج أو التهاب اللثة.\n• حساسية الأسنان.\n• ظهور بعض التقرحات في اللثة.\n• هذه الأعراض مؤقتة وغالباً ما تزول بعد نزول بعد عدة أيام، لكن اذا استمرت لفترة طويلة فتجب رؤية طبيب الأسنان. ";
  String s8="• التأثير على طبقة المينا في الأسنان مما يعمل على إضعافها، وقد يصل للحد الذي يجعل الأسنان عُرضة للإصابة بالحساسية.\n• الإصابة بحساسية اللثة والتي قد تحدث نتيجة تأثرها بالمواد المُستخدمة في عمليات التبييض.\n• قتل البكتيريا النافعة في الفم والتي تساعد في وجود توازن مع البكتيريا الضارة، مما يزيد من فرص العدوى والالتهاب بالفم. ";
  String s9="• كيف تحافظ على نتيجة التبييض بالليزر؟\nبعد عمل تبييض بالليزر تظهر لك نتائج رائعة وفورية بعد الجلسة مباشرة ولذا عليك الحفاظ على هذه النتيجة من خلال:";
  String s10="• العناية بنظافة الأسنان وتفريشها باستخدام معجون أسنان مناسب وفرشاة طبية على الأقل مرتين يومياً.\n• التقليل من شرب الشاي والقهوة والإقلاع عن التدخين.\n• يمكنك استعمال اللاصقات أو البودرة المبيضة في المنزل بعد ليزر الأسنان لتحافظ على نتائجه.";
  String s11="منذ القدم يستهوي النساء تجميل الأسنان، إذ كن يستخدمن في ذلك الذهب والفضة، ولكن هذه الموضة عفى عليها الزمن في ظل بروز التقنيات الحديثة التي طالت عالم طب الأسنان، ونتج عنها صرعات جديدة في مجال إكسسوارات الأسنان والتي تناسب أذواق السيدات. ومن هذه الصرعات تركيب الكريستال والألماس لإضافة رونق جذاب للأسنان.";
  String s12="تزيين الأسنان بالكريستال هو إجراء غير جراحي سريع وفي غاية البساطة، يتم به إضافة كريستالة واحدة لسن من الأسنان الأمامية، لإضفاء مظهر جميل وجذاب على الأسنان وخاصة أثناء الابتسامة.";
  String s13="تعد مجوهرات الاسنان واحد من أكثر أنواع الإكسسوارات إنتشارا في الأونة الأخيرة، حيث يعطي شكلا أنيقا للفتيات والنساء، وربما أصبح نوعا من أنواع لفت الإنتباه، في البرسينج يعطي شكلا مختلفا للنساء.";
  String s14="•  حساسية الأسنان المؤقتة التي يسببها الحمض.\n• في حال سوء نظافه الفم يكون هناك عرضة لتراكم البلاك ونمو مثالي لبكتيريا التسوس.\n• لا ينصح بذلك للمريض الذي يعاني من تسوس عالي حيث إن بعض حلي الأسنان تتطلب تحضير الأسنان مما يسبب عيب دائم في الأسنان وهذه المناطق معرضة للتسوس بعد ذلك.\n• التهاب اللثة وتناقص النطق.\n• يمكن أن يكون أيضًا مسارًا انسدادًا أثناء أخذ الأشعة السينية للفحص الشفوي الكامل. ";
  String s15="• يجب إخبار المريض أن الأمر قد يستغرق بضع ساعات حتى يعتاد على الجوهرة الموجودة في الفم.\n• ويحافظ على نظافة الفم الجيدة ويتجنب التفريش القاسي.\n• تجنب تناول الأطعمة اللزجة والصلبة إلى حد ما حيث قد يتم التخلص منها إذا تم تطبيق المزيد من الضغط على واجهة الترابط.\n• لذلك، يتم توجيه المريض بشأن هذه الأمور لتتوخى الحذر قبل وبعد عملية تجميل الأسنان.";
  String s16="لطالما العلاج التجميلي للأسنان الأمامية يعد تحديًا في الممارسة السريرية. مع تحسين مواد طب الأسنان، أصبحت العديد من الخيارات الترميمية مثل الحشوات التجميلية وجميع التيجان الخزفية والقشور الخزفية بأنواعها متاحة.";
  String s17="- القشور الخزفية: هي طبقة رقيقه خزفية يتم وضعها على السطح الخارجي للأسنان فقط ولا يتم فيها تحضير كل أجزاء السن.";
  String s18="- الزيركون: هو نوع من أنواع التركيبات الكاملة للأسنان حيث يتم تحضير السن وعمل تغطية كاملة له ويستخدم كعرض علاجي مع الغرض التجميلي.";
  String s19="- القشور الخزفية: يساعد في إزالة اصفرار الاسنان ومليء الفراغات الموجودة بينها والمساعدة في علاج التشققات الصغيرة التي تكون على طبقه الاسنان.\n\n- الزيركون: أكثر قوة ومتانه حيث يستخدم في حالات لا يصلح بها استخدام القشور الخزفية مثل إذا كان جزء كبير من السن مفقود أو يحتوي ع حشوات كبيره او يحتاج إلى تعديل كبير في جميع الاتجاهات أو تضرر في طبقات السن الخارجية.";
  String s20="• عند تطبيق القشور على الطبقة الخارجية من الأسنان يتم أولًا برد الأسنان من الخارج أي “طبقة المينا” والتي تعد حاجز حماية لدى الأسنان مما قد يؤدي لزيادة الحساسية في الأسنان أو تكوين تسوس غير ظاهر تحت طبقة القشور.\n• في بعض الحالات إذا كان هناك بعض الفراغ بين اللثة والسن يتم تراكم الجراثيم وتسبب التهابات شديدة. لكن لا داعي للخوف إن قام بإجرائها طبيب محترف.\n• رغم جمالية القشور والزيركون واعطائهم شكلًا مذهلًا للأسنان لكن لا يمكن إزالتهم بأي شكل من الأشكال.\n• يسبب كل من القشور والزيركون في بعض الحالات احتكاك مع الجذور والأسنان المقابلة.\n• لا يتوفر درجات من الألوان في الزيركون مما يسبب عدم تناسق ألوان أسنان الزيركون مع الأسنان الطبيعية.\n• يغطي الزيركون السن كاملًا مما بسبب صعوبة باكتشاف المشاكل تحت تيجان الزيركون.";
  String s21="يعد السبب الأكثر شيوعا للحصول على القشور هو الرغبة التجميلية للأسنان فليس من اللائق أن يتمتع الشخص بابتسامة جذابة مصحوبة برائحة كريهة للفم! قد يتسبب القشور في تلك المشكلة في حالة عدم انسجامه مع خط اللثة وعدم مطابقته للسن بشكل دقيق مما يخلق فراغات صغيرة بينه وبين الأسنان تتجمع بها بقايا الأطعمة وتنشط بها البكتريا المسببة لرائحة الفم الكريهة وكذلك التهابات اللثة وربما تسوس الأسنان أسفله.";
  String s22="1. عليك أن تتجنب التدخين لأنه يؤثر بشكل مباشر على البياض الناصع للقشور وعلى الصحة بشكل عام.\n2. تجنب الطعام ذو الملمس الصلب لأنها قد تتسبب بإحداث كسر في الأسنان أو بعض التشققات غير المرغوب فيها .\n3. يتطلب القشور والزيركون العناية المستمرة ليبقوا ناصعين وذلك بتنظيفهم مرتين يوميًا باستخدام الفرشاة والمعجون المناسب.\n4. الأفضل الابتعاد عن جميع الأطعمة والمشروبات التي تحتوي على صبغات الطعام الملونة كالمشروبات التي تحتوي صبغات اصطناعية أو الشاي الذي يحوي صبغات طبيعية، ويفضل أيضًا الابتعاد عن الكحول بكافة أنواعها لتجنب بهتان ابتسامة هوليوود .\n5. كذلك يجب عليك الالتزام بالمراجعة الدورية لطبيب الأسنان للتأكد من صحة الأسنان واللثة وإزالة أي عرض قد يظهر والمساهمة في معالجته مبكرًا قبل تفاقمه.\n6. لا تستخدم معجون أسنان مبيض من دون استشارة الطبيب أولًا لأنه ربما يسبب خدوشًا كثيرة.";
  String s23="عملية قص اللثة بشكل عام هي محاولة تهذيب شكل اللثة عن طريق إزالة بعض الأنسجة الزائدة منها من ناحية الأسنان.وهي طريقة شائعة في تجميل الأسنان وجعلها تبدو أكثر تناسقا وجاذبية. يمكن قص اللثة في منطقة واحدة صغيرة أو بطول اللثة كلها حسب الحاجة والظروف.";
  String s24="يعد من أهم مميزات قص وتجميل اللثة هو التمتع بفم صحي خالي من المشاكل المختلفة، كما يتمتع أيضاالمتعافون من عمليات قص اللثة بمظهر جمالي يعزز الثقة بالنفس.تتميز عملية قص اللثة أيضا بقلة الحاجة للتخدير حيث إن الألم الناتجة عنها قليلة يمكن تفاديها بنسب قليلة من المخدر الموضعي.";
  String s25="هناك بعض المخاطر المرتبطة بإجراء الجراحة، إلا أنها محدودة ونادرة الحدوث أحيانا، وتتمثل فيما يأتي:\n\n• رد فعل تحسسي تجاه المخدر.\n• تراجع وانحسار اللثة.\n• دخول بكتيريا ضارة إلى مجرى الدم.\n• استمرار النزيف لعدة أيام.";
  String s26="• اتباع النظام الغذائي المناسب كتجنب الأطعمة القاسية والحارة والاعتماد على الطعام اللين.";
  String s27="• الالتزام باستخدام العقاقير التي يصفها الطبيب.\n\n• الالتزام بزيارات المتابعة المحددة من قبل الطبيب.\n\n• احرص دائما على حماية منطقة إجراء العملية كالتقليل من الأنشطة البدنية العنيفة والاكتفاء بالرياضات الخفيفة التي تحسن الدورة الدموية وزيادة معدل التئام الجرح.";
  String s28="• تجنب التدخين بعد إجراء عملية قص اللثة لأنه يقلل من معدل التئام الجروح وإمكانية تسببه بتلوث ملحوظ فمن الضروري تجنب التدخين مده ٢٤ ساعة على أقل تقدير عقب العملية.";
  String s29="• احرص على استخدام كمادات الثلج فإنه يعد أمرا ضروريا للسيطرة على اعراض التورم والألآم البسيطة التي تعقب إجراء العملية.";
  String s30="\n• Bhatia, S., Gupta, N., Gupta, P., Arora, V., & Mehta, N. (2015). Tooth jewellery: Fashion and dentistry go hand in hand. Indian J Dent Adv, 7(4), 263-267.\n\n• Buragohain, A. (2020). Tooth Jewellery–Brightening Smiles the World Over. Journal Of Applied Dental and Medical Sciences, 6, 1.\n\n• Korkut, B., Yanıkoğlu, F., & Günday, M. (2013). Direct composite laminate veneers: three case reports. Journal of dental research, dental clinics, dental prospects, 7(2), 105.\n\n• Minoux, M., & Serfaty, R. (2008). Vital tooth bleaching: Biologic adverse effects—A review. Quintessence international, 39(8).\n\n• Oliveira, M. T., Molina, G. O., Furtado, A., Ghizoni, J. S., & Pereira, J. R. (2013).\n\n• Patil, A. G. (2010). Tooth jewellery: A simple way to add sparkle to your smile. Ind J Dent Adv, 2(4), 356-58.\n\n• Pini, N. P., Aguiar, F. H. B., Lima, D. A. N. L., Lovadino, J. R., Terada, R. S. S., & Pascotto, R. C. (2012). Advances in dental veneers: materials, applications, and techniques. Clinical, Cosmetic and Investigational Dentistry, 4, 9.\n\n• Shanbhag, R., Veena, R., Nanjannawar, G., Patil, J., Hugar, S., & Vagrali, H. (2013). Use of clinical bleaching with 35% hydrogen peroxide in esthetic improvement of fluorotic human incisors in vivo. The journal of contemporary dental practice, 14(2), 208.\n\n• Tomar, N., Dureja, D., Kaushik, M., & Wadhawan, A. Diagnosing and managing the prodigious gingivae with distinct etiologies–a fight for reinstating big smile from the big gum: a case series.\n\n• Zhang, Y., & Lawn, B. R. (2019). Evaluating dental zirconia. Dental Materials, 35(1), 15-23.";
}

class Treat{
  String s1="المعالجة الوقائية هي عملية يتم القيام بها بهدف الوقاية من مشاكل صحة الفم .  الهدف السامي منها هو  الحفاظ على صحة الأسنان واللثة والفم قدر الإمكان لمنع تسوس الأسنان وأمراض اللثة وغيرها من المشكلات قبل حدوثها.\nوتشمل فحوصات الاسنان المنتظمة، التي يتم بها التاكد من صحة الاسنان وتطبيق مواد وقائية كالفلورايد والمادة السادة الوقائية  ، بالاضافة الى إعطاء تعليمات من شأنها ان تعمل على تطوير  السلوكيات الصحيحة وايقاف السلوكيات الخاطئة عند المرضى.";
  String s2="المادة السادة الوقائية هي عبارة عن علاج سنّي يهدف إلى الحماية من تسوس ونخر الأسنان. يتم تصنيع المواد السادة الوقائية من نوع خاص من البلاستيك وايضا يمكن استخدامها في مواد طب الاسنان في بعض الاحيان ،ويتم وضع طبقه علي اسطح المضغ في الاسنان ،لانها تغطي الحفر العميقه التي تكون معرضه لخطر الاصابه بتسوس الاسنان.";
  String s3="الاطفال والبالغين ،ويتم تطبيقها في وقت مبكر من العمر،لانها توفر حمايه للاسنان من التسوس.";
  String s4="1. تحمي هذه المواد الأسنان التجاويف التي تكون موجوده علي اسطح المضغ.\n2. التجاويف والحفر العميقه يمكن ان تعلق بها بقايا الطعام المسببه للتسوس.\n3. تعمل كطبقة واقيه تمنع دخول البكتيريا والطعام.";
  String s5="1. مراجعة طبيب الاسنان بشكل دوري ومنتظم.\n2.تنظيف الاسنان بشكل جيد ومنتظم لتقليل من تراكم بقايا الطعام.";
  String s6="- تقلل من التسوس.\nويتم وضعها بإستخدام التقنيات المناسبة الفعالة في منع التسوس.\n- توفير المال علي نفقات الرعايه الصحيه مثل الرعايه الترميمه والجراحيه واللبيه.";
  String s7="يمكنها حماية الاسنان من التسوس لمده تصل عشر سنوات ولكن يجب فحصها بشكل منتظم عند طبيب الاسنان.\n\nبالرغم من أن مادة سد الشقوق تتآكل طبيعيًا وتتلف مع الوقت، إلا أنها تبقى فاعلة لمدة 10 سنوات أو أكثر، حتى مع الضغط الكبير الذي يتحمله السن خلال المضغ يوميًا. طول عمر المادة السادة الوقائية يعتمد على نوع المادة المستخدمة .";
  String s8="- تاريخ مرضي مع تسوس الأسنان.\n- شقوق وأخاديد عميقة في السن.\n- إشارات مبكرة لتسوس الأسنان.\n- خلل في طبقة مينا الاسنان.";
  String s9="- غذاء متوازن فيه كمية منخفضة من السكر والكربوهيدرات.\n- رعاية فموية جيدة.\n- الشقوق والأخاديد التي رُمِمَت سابقًا.";
  String s10="يستخدم الحاجز المطاطي لمنع اللعاب من الوصول إلى السن المراد علاجه، ولكنها في بعض الأحيان لا تُستَخدَم، خاصةً عند الأطفال.\nيتم تنظيف السطح وتجفيفه.\nيتطلب استخدام حمض الفسفوريك لخلق مسامات مجهرية على السن (فتزيد من مساحة السطح وتزيد قوة ارتباط مادة سد الشقوق بالسن).\nوبعد وضع المادة على السن فهي تثبت وتجف إما بتسليط الضوء عليها أو تركها لتجف بنفسها (اعتمادًا على نوع المادة).\nاستخدام خيط الاسنان للتأكد من ازالة بقايا المواد بين الاسنان.\nعملية سد الشقوق تعتبر عمليه بسيطة وغير مؤلمة.";
  String s11="• الفلوريد معدن موجود بشكل طبيعي في أجسادنا في العظام والأسنان ، هو كذلك يعتبر جزءًا من طب الأسنان الوقائي، لأنه يستخدم بشكل أساسي لتحسين صحة الأسنان.\n• يمكنك إضافة الفلورايد لماء الشرب من خلال عملية تسمى -فلورة الماء- وفي العديد من المنتجات التي لا تستلزم وصفة طبية بما في ذلك: معجون الأسنان وغسول الفم والمكملات.";
  String s12="• تطبيق ذاتي.\n• معاجين الأسنان: كمية بحجم حبة البازلاء لمدة 6 سنوات أو أقل.\n• خيط تنظيف الأسنان المشبع بالفلورايد: بين الاسنان يتم استخدام الخيط وتطبيق الفلورايد.\n• مضمضات  الفلورايد: يغسل  مرة واحدة في اليوم لمدة دقيقة واحدة.";
  String s13="مكملات الفلوريد: قطرات ، أقراص بالغذاء: شاي ، ملح ، سكر ، ماء ، حليب يستخدم لعلاج هشاشة العظام.";
  String s14="• التركيز: 2٪\n• تعتبر إدارة الغذاء والدواء أن هذا النوع آمن وفعال.\n• يجب استخدامه بجرعات منخفضة.";
  String s15="• التركيز:  8٪ -10٪.\n• عامل مضاد للبكتيريا ثبت سريريًا أنه يحمي من:\nالتهاب اللثة ، البلاك وحساسية الأسنان ، مع استمرار توفير.\nحماية قوية ضد التسوس خصوصا في مراحله الاولى.";
  String s16="• تم إدخاله إلى طب الأسنان في الستينيات من القرن الماضي.\n• التركيز: 1.23٪.\n• الأكثر شيوعاً في العيادات ويستخدم بشكل كبير.";
  String s17="• مشابه لجل الفلوريد الذي يتم وضعه خلال زيارة تنظيف الاسنان ( التي تستخدم بقوالب  خاصة) لكن، الفلورايد فارنش يبقى على الأسنان لبضع ساعات اطول كي يضاعف فعاليته.\n• يغسل  بعد 4-6 ساعات( حسب تعليمات الشركات المصنعة).\n• يمكن تطبيق هذا النوع من الفلورايد على كل الفم في حوالي دقيقتين, يمكن أن يكون وسيلة اقتصادية لعلاج الحساسية عند البالغين كما يحمي الأسنان من التسوس.";
  String s18="من المعروف على نطاق واسع أن الفلورايد يمنع تسوس الأسنان وفقدان الأسنان المبكر عند الأطفال.\nساعدت التطورات الجديدة في الفلورايد في معالجة مشاكل الأسنان عند الأطفال بشكل كبير.";
  String s19="• يمكن تطبيق الفلوريد فارنش على الأسنان الموجودة البازغة سواء جزئيا او كليا.\n• يمكن استخدامه أيضًا حول تقويم الأسنان حيث تساعد في تقوية طبقة المينا ومنع حدوث مشاكل كالتسوسات والعيوب التجميلية التي تظهر في بعض الأحيان بسبب التقويم .\n• يعتبر وسيلة طبية فعالة تساعد في الحفاظ على الاسنان عند الأطفال الذين يعان من جفاف الفم ( بسبب الأدوية أو علاج السرطان او غيرها ).";
  String s20="ينصح به لـ :\n• الأطفال الذين لا يشربون ماء مفلورة: قد يعانون من نقص الفلورايد وهذا يسبب تسوس ، ضعف في العظام والأسنان ، لذلك ننصحهم باستخدام الفلورايد في عيادة الأسنان والمنزل ( باستخدام معجون الأسنان ومضمضات الفلورايد).\n• الذين يعانون من مسافات بين الأسنان: المسافات بين الأسنان هي منطقة جيدة لتواجد البكتيريا  التي تسبب تسوس الاسنان ، لأن الطعام قد يتراكم في الفراغ والفرشاة قد لا تصل لهذه الفراغات فيتطور تسوس الأسنان هناك.\n• المرضى المعرضون لمخاطر التسوس : كالاشخاص الذين يتعالجون علاج كيميائي او اشعاعي تكون اسنانهم معرضه للتسوس بشكل كبير , ايضا الذين يعانون من جفاف الفم.\n• الأطفال الذين تتراوح أعمارهم بين 3-6 سنوات:غالبًا ما يبدأ تطبيق الفلورايد بشكل وقائي  خلال هذه الفترة.";
  String s21="• حفر وشقوق عميقة في الأسنان :\n قد ياتي سطح السن الطاحن بشقوق وحفر عميقة يصعب على الفرشاة تنظيفها لانها ضيقة لذلك في هذه الحالة يوصى باستخدام الفلورايد شائعة بشكل خاص عند الأطفال والمراهقين وقد ينتج عنها التسوس.";
  String s22="• على الرغم من أن الفلورايد آمن لصحة الأسنان لكن يجب استخدامه بتراكيز منخفضة لان  الاستهلاك المستدام لكميات كبيرة من أملاح الفلوريد القابلة للذوبان خطير ويمكن أن تكون قاتل.\n• الجرعة المميتة لمعظم البالغين تقدر بـ 5 إلى 10 جرام(وهو ما يعادل 32 إلى 64 مجم فلوريد / كجم من الجسم).";
  String s23="• اقترحت بعض الأبحاث أن المستويات العالية من التعرض للفلورايد قد يؤثر عكسيًاعلى النمو العصبي عند الأطفال.";
  String s24="• ارتفاع تركيز الفلوريد يؤثر على شغل الكلى في فلترة البول ، مما يؤدي إلى التبول المتكرر وجفاف الجسم نتيجة فقدان السوائل,ارتفاع الصوديوم وفرط الأسمولية.";
  String s25="• فلورة الاسنان، والذي يمكن أن يغير مظهر أسنان الأطفال أثناء نمو الأسنان هذا هو في الغالب مشكلة جمالية لا اكثر . يُقدر أن الفلورة حتى 1 مجم / لتر تسبب فلورة اسنان .";
  String s26="- ستتأثر آليتها بشكل خاص عند وجود نقص اليود في الجسم.\nالمرضى الذين لا يستطيعون تطبيق الفلورايد:\n• الذين يعانون من فلورة الاسنان.\n• مشاكل الجهاز الهضمي مثل الغثيان والقيء.\n• المرضى الذين يعانون من حساسية من الفلورايد التي  قد تسبب طفح جلدي.\n• المرضى الملتزمين بوجبات منخفضة الصوديوم أو خالية من الصوديوم.\n• الذين ياخذون ادوية فيها الموليبدينوم ، لأنها تتفاعل مع بعضها البعض ويسبب الكثير من المشاكل.";
  String s27="1. قوالب البوليسترين.\n2. جل الفلوريد.\n3. سيرنج الهواء والماء من اجل شطف وتجفيف الاسنان قبل تطبيق الفلورايد (في حال كان المرض لا يعاني من حساسية).\n4. شفاط اللعاب.\n5. قطن وشاش لتجفيف الاسنان وتنظيفها قبل تطبيق الفلورايد ( في حال كان المريض يعاني من حساسية اسنان).";
  String s28="1. اختيار قالب بحجم مناسب للأسنان ( قالب بولسترين يصلح للاستخدام مرة واحدة ).\n2. وضع كمية قليلة من جل الفلورايد ( لكل قالب 1.5مل) ( النوع الأكثر استخدماً  هو APF 1.23%  فلورايد الصوديوم ).\n3. تنشيف الأسنان بالهواء ثم ادخال القالب و التأكد من أن المادة تغطي جميع الاسنان.\n4. ادخال شافط اللعاب .\n5. دع الطفل يعض على شافط اللعاب بأسنانه.\n6.  استخدام شافط اللعاب مهم جداً في هذه المرحلة لمنع بلع هذه المادة المركزة.\n7. بعد التطبيق ، يجب استخدام شافط اللعاب لمدة 30 ثانية على الأقل لإزالة أي فائض من الفلوريد المتبقي.";
  String s29="1. القبول الجيد من المريض.\n2. طول مدة فاعلية المواد.\n3. القدرة على السيطرة على المناطق التي يطبق عليها الفلورايد.\n4. السرعة و الوقت القصير للتطبيق.";
  String s30="1. الوقت الموصى به لتطبيق الفلورايد في عيادة الأسنان هو من 1-4 دقائق.\n\n2. التراكيز الآمنة للفورايد:\n• حسب منظمة الصحة العالمية يعتبر تركيز الفلورايد في مياه الشرب عند 1 – 0.5 جزء في المليون هو الأكثر ملاءمة لتثبيط التسوس دون التسبب في أي ضرر. وجد أن التركيزات التي تزيد عن 1 جزء في المليون قد تسبب تسمم الأسنان بالفلور . التركيز المثالي للفلورايد في مياه الشرب هو 0.7.\n• في معاجين الأسنان للبالغين: يجب الانتباه والتأكد من تركيز الفلورايد في معجون الأسنان قبل شرائه والتأكد من أن تركيزه في معجون الأسنان للكبار  1450 جزء بالمليون.\n• في معاجين الأسنان للأطفال : يفضل ألا يقل التركيز عن 1000 جزء بالمليون.\n\n3. قد يكون الفلوريد مقبولاً للاستخدام أثناء الحمل. أيضًا ، يعتبر الفلورايد آمنًا أثناء الرضاعة الطبيعية عند استخدامه بجرعات أقل من 10 ملغ في اليوم  ؛ آمن بالكميات الموجودة في معاجين الأسنان وغسول الفم وعلاجات الأسنان بالفلورايد.";
  String s31="1. لا تستخدم الفرشاة أو الخيط.\n2. تجنب الأكل والشرب والمنتجات التي تحتوي على الكحول.\n3. تجنب عناصر الفلوريد الأخرى -التي لا تستلزم وصفة طبية- مثل معاجين الأسنان ، والمواد الهلامية ، وغسول الأسنان.\n4. لا تستخدم أدوية الفلورايد الموصوفة لك من الطبيب مثل Gel-Kam أو Periomed لمدة ثلاثة أيام بعد العلاج.\n5. استخدم هذا الدواء بانتظام في حال وصفها من الطبيب من أجل الحصول على أقصى استفادة منه بعد هذه الأيام الثلاثة.";
  String s32="-  الكهربائية (أجهزة اختبار حيوية العصب).\n-  حراري (بارد - دافئ).\n-  ميكانيكي عن طريق اللمس.\n- المنبهات الكيميائية (الأحماض).";
  String s33=" تآكل الأسنان يؤدي إلى تعري الطبقة التي تحتوي على مستقبلات الإحساس بالأسنان لذلك ترميم السن ضروري لوقف الإحساس بالحساسية و الالتزام بمادة الفلورايد لتعويض الأسنان المعادن المفقودة أهمها الكاليسيوم و الفسفور التي يرسبها الفلورايد داخل السن.";
  String s34="- هناك جزئين أساسيين لزيارة طبيب الأسنان. أولاً، سيفحص طبيب الأسنان حالة فمك بالكامل، بما في ذلك الأسنان واللثة واللسان كفحص روتيني. سيأخذون صورًا بالأشعة السينية للمساعدة في الحصول على فكرة أفضل عما يحدث داخل فمك.";
  String s35="- بعد ذلك ، سيوفر طبيب الأسنان التنظيف باستخدام أدوات مختلفة ، مثل الكاشطات والمرايا الصغيرة ، لتنظيف الأسنان الأساسي من أي تراكم للبلاك أو الجير. سيقدم طبيب الأسنان خطة متابعة ويطلب منك تحديد المواعيد لأي عمل آخر قد يكون مطلوبًا، مثل سحب العصب والحشوات.";
  String s36="• منع المشكلات المستقبلية.\n• المحافظة على الأسنان.\n• التثقيف حول النظافة السليمة للأسنان.\n• المساعدة في المشكلات ذات الصلة.\n• علاج رائحة الفم الكريهة.\n• .الحصول على ابتسامة جيدة.";
  String s37="زيارة طبيب الاسنان بشكل منتظم ليست فقط مهمة لتلقي العلاج والمحافظة على الاسنان بل هي مهمة أيضا للكشف المبكر عن أنواع كثيرة من السرطانات التي تحدث داخل الفم يكمن الهدف من فحص سرطان الفم في اكتشاف سرطان الفم أو الأمراض التي تكون مقدمة للسرطان والتي قد تؤدي إلى الإصابة بسرطان الفم في مرحلة مبكرة عندما يكون من السهل استئصال السرطان ويكون من المرجَّح علاجه.";
  String s38="يعتبر التدخين أحد الأسباب الرئيسية لسرطان الفم والحلق، فضرره لا يقتصر فقط على تلون الأسنان والتهابات اللثة، بل يتعداه إلى الأورام التي قد تكون وخيمة. وترتفع مخاطر الإصابة بسرطانات الفم إذا كان الشخص المدخن يشرب الكحول أيضا. يؤدي التدخين إلى تقليل تدفق الدم في اللثة والأنسجة الداعمة للسن مما يجعلها أكثر عرضة للالتهاب. كما أنه قد يغير طبيعة البكتيريا الموجودة في اللويحة الجرثومية (البلاك) على الأسنان، ويزيد عدد البكتيريا الأكثر إضرارا بالأسنان. كما أن التهابات اللثة تسير بشكل أسرع وأكثر حدّة لدى الأشخاص المدخنين مقارنة بغيرهم.";
  String s39="- تلون الأسنان بأصباغ بنية اللون قد تميل إلى السواد. يشمل التلون أيضا التركيبات السنية مثل الحشوات السنية وأطقم الأسنان.\n- زيادة احتمالية تسوس الأسنان.\n- رفع مخاطر فقدان الأسنان.";
  String s40="- التهاب اللثة (gingivitis).\n- التهاب دعائم السن (periodontitis).\n- تراجع العظم السنخي الذي يدعم جذور الأسنان نتيجة تراجع مستوى العظم السنخي يتراجع مستوى اللثة، مما يؤدي إلى تكون فراغات بين الأسنان.\n- تلون اللثة عبر ظهور بقع بنية عليها.";
  String s41="رائحة الفم الكريهة (بخر الفم).\n- تراجع القدرة على التذوق.\n- تراجع نشاط بعض الأنزيمات الموجودة في اللعاب نتيجة المواد الكيميائية الكائنة في التبغ.\nزيادة مخاطر ظهور -ليكوبليكيا- (leukoplakia)، وهي آفة بيضاء اللون في الفم يمكن أن تتطور إلى سرطان.";
  String s42="1- اختر يوماً للإقلاع عن التدخين او الكحول والتزم بذلك اليوم، وتحدث إلى الأشخاص الذين اقلعوا عنهم وشاركهم تجاربهم، واحصل على الدعم من العائلة والأصدقاء ، وإن اضطر الأمر بإمكانك أخذ المساعدة من طبيبك.\n\n2- خذ بعين الاعتبار المخاطر الصحية وعلى رأسها السرطان وكل الأمراض والحالات المحتملة حدوثها واكتبها على ورقة وعلقها في مكان بحيث يمكنك رؤيتها دائما.\n\n3- قم بممارسة التمارين الرياضية بانتظام أو المشي السريع الخفيف لمدة 20-30 دقيقة يوميا وذلك لطرح تلك السموم من الجسد واسترجاع صحة الرئتين إلى ما كانا عليه .\n\n4- ابتعد قدر الإمكان عن الأماكن التي تتواجد فيها الكحوليات والتدخين .";
  String res="1. Gore, D. R. The use of dental sealants in adults: a long‐neglected preventive measure. International Journal of Dental Hygiene 8.3 (2010): 198-203.\n\n2. Gore, D. R. (2010). The use of dental sealants in adults: a long‐neglected preventive measure. International Journal of Dental Hygiene, 8(3), 198-203.\n\n3. Gore, D. R. The use of dental sealants in adults: a long‐neglected preventive measure. International Journal of Dental Hygiene 8, no. 3 (2010): 198-203.\n\n4. Beltrán-Aguilar, Eugenio D., et al. Surveillance for dental caries, dental sealants, tooth retention, edentulism, and enamel fluorosis; United States, 1988-1994 and 1999-2002. (2005).\n\n5. Junger, Michele L., et al. Peer reviewed: awareness among US adults of dental sealants for caries prevention. Preventing chronic disease 16 (2019).\n\n6. Junger, M. L., Griffin, S. O., Lesaja, S., & Espinoza, L. (2019). Peer reviewed: awareness among US adults of dental sealants for caries prevention. Preventing chronic disease, 16.\n\n7. Sionov, Ronit Vogt, et al. Tooth mousse containing casein phosphopeptide-amorphous calcium phosphate prevents biofilm formation of Streptococcus mutans. BMC Oral Health 21.1 (2021): 1-10.\n\n8. James, Patrice, et al. Impact of reducing water fluoride on dental caries and fluorosis. Journal of Dental Research 100.5 (2021): 507-514.\n\n9. Zampetti, P., and A. Scribante. Historical and bibliometric notes on the use of fluoride in caries prevention. European Journal of Paediatric Dentistry 21.2 (2020): 148-152.\n\n10. Al Harbi, Taghreed Ahmed, et al. Effectiveness of Topical Fluoride on Dental Caries: A Literature Review. Ec Microbiology 16 (2020): 01-09.\n\n11. James, Patrice, et al. Impact of reducing water fluoride on dental caries and fluorosis. Journal of Dental Research 100.5 (2021): 507-514.\n\n12. Johnston, Nichole R., and Scott A. Strobel. Principles of fluoride toxicity and the cellular response: A review. Archives of toxicology 94.4 (2020): 1051-1069.\n\n13. Langevin, Scott M., et al. Regular dental visits are associated with earlier stage at diagnosis for oral and pharyngeal cancer. Cancer Causes & Control 23.11 (2012): 1821-1829.\n\n14. Siegel, Rebecca, et al.Cancer statistics, 2011: the impact of eliminating socioeconomic and racial disparities on premature cancer deaths. CA: a cancer journal for clinicians 61.4 (2011): 212-236.\n\n15. Petersen, Poul Erik. Dental visits and self‐assessment of dental health status in the adult Danish population. Community Dentistry and Oral Epidemiology 11.3 (1983): 162-168.\n\n16. Dodds, M. W. J., S. C. Hsieh, and D. A. Johnson. The effect of increased mastication by daily gum-chewing on salivary gland output and dental plaque acidogenicity. Journal of dental research 70.12 (1991): 1474-1478.";
}

class Habit {
  String s1="نستطيع القول لتبسيط الأمر بأن كل فعل متكرر يقوم به الشخص بواسطة فمه يكون في البداية إرادياً، ويتحول فيما بعد إلى سلوك غير إرادي يعتبر أنه عادة فموية.\nسنتعرف على مفهوم العادة الفموية السيئة، وعلى  أشكال مختلفة لها، أسبابها وإلى ماذا تؤدي، ثم سنتعرف على بعض الخطط العلاجية البسيطة لها .";
  String s2="هي عادة شائعة وضارة للأسنان و هي استخدام الأسنان للقيام بوظائف غريبة منها  فتح الأشياء أو قطع مواد معينة أو عقد بعض الأشياء الصلبة والثقيلة.";
  String s3="1- تسبب كسر الاسنان  بحيث لا تنمو مرة اخرى مما يتطلب عمل تركيبة صناعية :\n- مشكلات كسر الاسنان في حالة كشف العصب تؤدي الى الاصابة بالالم ويحتاج المريض لعلاج العصب وقد تحتاج الى تركيبات ما يكلف الكثير من الجهد والمال.\n- في حالة تعرض الاسنان للكسر دون الوصول للعصب , فيؤثر ذلك على شكل السن وقد تؤذي فم المريض من خلال مكان الكسر الحاد الذي يسبب خدش في تجويف الفم , وهو ما يجبر المريض على علاجها.";
  String s4="2- التهاب اللثة لان بعض القطع التي يتم وضعها في الفم قد تحمل بعض البكتيريا المسببة ل التهاب الفم وخاصة اللثة وقد تصل الى مشكلات في المعدة.";
  String s5="3- خلخلة الاسنان مع استمرار القيام بهذه العادة يحدث تخلخل للسن ما ينذر باحتمالية سقوطها .";
  String s6="قضم الأظافر : هي مشكلة طبية شائعة و غير معالجة عند الأطفال وهي رد فعل للاطرابات النفسية و التوتر , و يزداد معدل ارتفاعها في فترة المراعقة و من ثم تنخفض لاحقا.";
  String s7="1. سوء الاطباق في الأسنان الأمامية (تتحرك من مكانها).\n2. حساسية الأسنان.\n3. تشقق الأسنان و تآكلها.\n4. ألم بالفك و صداع بسبب الضغط على الأسنان.\n5. فقدان الأسنان (تساقطها).\n6. التهاب الأمعاء عن طريف نقل البكتيريا من الفم الى الأمعاء.\n7. تدمير سنخ السن.\n8. انحسار اللثه و تقرحها.\n9. تآكل جذور الأسنان.";
  String s8="1- الاعتناء بالأظافر يمكن أن يساعد على التقليل من عادة قضم الظفر و يشجع على بقاءها جميلة و مرتبة.\n2- التنبيه عن طريق :\n- وضع طلاء الأظافر.\n- وضع مواد ذات طعم سيء.\n3- حاول اللجوء الى أساليب عملية لتخفيف التوتر و الشعور بالاجهاد و ملىء الفراغ بدلا من تفريغ أفكارك السلبية و قلقك على أظافرك.\n4- وضع شرائط أو لاصقات ملونة على الأظفر للتذكير بعدم قضم الأظافر.";
  String s9="هو عادة شائعة تحدث اثناء النوم واليقظة وهو عبارة عن طحن الفك العلوي مع الفك السفلي للأسنان. صرير الاسنان وانت مستيقظ يحدث عندنا تطحن اسنانك بدون وعي خلال النهار.";
  String s10="معظم الناس يطحنون اسنانهم بسبب القلق او التوتر او عندما يحاولون التركيز في شيء ما.";
  String s11="1- تعديل السلوك مثل الوعي بهذه العادة.\n2- الابتعاد عن مسببات التوتر.\n3-اتباع تقنيات التنفس العميق.";
  String s12="* الأنشطة الوظيفية عبارة عن أنشطة عضلية يتم التحكم فيها بشكل كبير ، مما يسمح لجهاز المضغ بأداء الوظائف الضرورية. ومع ذلك ، فإن بعض ملامسات الأسنان المتداخلة لها تأثيرات مثبطة على نشاط العضلات الوظيفي.";
  String s13="* تتأثر وظيفة عضلات الفك ، والتي بدورها تؤثر على طريقة عمل المفصل الصدغي الفكي (TMJ). وبالتالي ، فإن أي تغييرات سيكون لها تأثير على هياكل المفصل الفكي الصدغي وعضلات الفك.";
  String s14="قد تترافق قلة من العوامل المورفولوجية مثل تشريح الهياكل العظمية للجهاز الفموي للفم مع صرير الأسنان ، العوامل المسببة الأخرى التي يمكن تمييزها من صرير الأسنان هي : العوامل النفسية والاجتماعية مثل الإجهاد وخصائص شخصية معينة ، والعوامل المركزية والناقلات العصبية الخاصة ، والعوامل المرضية الفسيولوجية (مثل الأمراض ، والصدمات ، والوراثة ، والتدخين ، والكحول ، وتناول الكافيين ، والعقاقير غير المشروعة والأدوية) ، اضطرابات النوم (انقطاع النفس النومي والشخير) ، وتورط جهاز الدوبامين.";
  String s15="عندما يتعلق الأمر بتنظيف أسنانك بالفرشاة ، فهناك شيء اسمه التقنية المناسبة. يمكن أن يؤدي تنظيف الأسنان بشدة أو استخدام فرشاة أسنان غير مناسبة إلى إتلاف أسنانك ولثتك ، مما يؤدي إلى مشاكل مثل :\n- تآكل المينا وانحسار اللثة ، مما قد يؤدي بدوره إلى حساسية الأسنان.";
  String s16="1. استخدام فرشاة أسنان غير مناسبة.\n2. تنظيف الأسنان بأوقات متقاربة جدًا.\n3. تخطي أسطح الأسنان الداخلية أثناء تنظيف الأسنان.";
  String s17="1- استخدام خيط الأسنان الطبي لإزالة الأوساخ المتراكمة بين الأسنان.\n2- وضع القليل من معجون الأسنان فرشاة الأسنان المغسولة جيدًا والرطبة.\n3- فرك الأسنان بحركة عمودي، وهنا يجب الابتعاد عن الفرك الأفقي كونه يتسبب بالعديد من المشكلات للثة.\n4- الاستمرار في الفرك لمدة دقيقتين.\n5- المضمضة بالماء أكثر من مرة.";
  String s18="* استخدم فرشاة أسنان ذات شعيرات ناعمة - واستبدله كل ثلاثة أشهر أو قبل ذلك إذا كان يضعف - .\n* ضع فرشاة أسنانك بزاوية 45 درجة على لثتك. بهذه الطريقة ، يمكن أن تصل الشعيرات إلى أسفل خط اللثة وتنظف.\n* حرك الفرشاة برفق للخلف وللأمام.\n* ينصح أطباء الأسنان بتنظيف أسنانك بالفرشاة لمدة دقيقتين كاملتين - 30 ثانية في كل ربع من فمك - مرتين في اليوم.";
  String s19="أكل الثلج هو الإستهلاك الذي لا يقاوم للثلج والمشروبات المثلجة ويعد شكل من أشكال الوحم (شهوة الغرائب) وقد كان مصحوباُ بأنيميا نقص الحديد وقد اظهر استجابة لمكملات الحديد موجهاً بعض الباحثين إلى افتراض أن بعض أشكال الوحم (شهوة الغرائب) قد يكون ناتج عن سوء التغذية ومضغ الثلج قد يخفف من ألم التهاب اللسان الناتج عن أنيميا.";
  String s20="- التأثير السلبي على الأسنان واللثة يؤدي مضغ الثلج بشكل مستمر إلى زيادة  لضغط على الأسنان وتآكل طبقة المينا، هي الطبقة الخارجية الرقيقة التي تحمي الأنسجة الداخلية الحساسة ، وقد يؤدي ذلك إلى تشقق الأسنان وبالتالي تسوسها.";
  String s21="- تضرر التيجان والحشوات بسبب مضغ الثلج، كما يمكن أن تصبح الأسنان ضعيفة وحساسة للأطعمة والمشروبات الباردة أو الساخنة.";
  String s22="- يُحدث أضراراً في الأسنان، ويسبب في كسرها وتفتت الحشوات وسقوطها، ويسرع من تآكل طبقة المينا فيها، وزيادة نخرها وتسوسها.";
  String s23="- يسبب إصابة اللثة بالنزيف والتقرحات، مما يساعد في الإصابة بالعدوات البكتيرية والفيروسيّة التي تتسرب من خلال الجروح.";
  String s24="- يُسبب آلاماً في الفكين، وعظام الفم، مع إحداث صعوبة بالغة في فتح الفم.";
  String s25=" علاج أكل الثلج أن كنت مصابا بفقر الدم الناجم عن نقص الحديد، فإن علاجه يفضي إلى علاج أعراض أكل الثلج وشهوة الغرائب بشكل عام من دون الحاجة لأي تدخل علاجي آخر. لكن يجب ألا يقوم الشخص بعلاج نفسه ذاتيا بمكملات الحديد من دون الرجوع إلى الطبيب أولا؛ ذلك بأن أخذ مكملات الحديد من دون حاجة يؤدي إلى تراكم الحديد في الجسم.";
  String s26="الوجبات الخفيفه : ما يتم تناوله بين الوجبات الرئيسية حيث تتكون من سكريات او كاربوهيدرات او فواكه يعد الإفراط في الوجبات الخفيفة بين الوجبات من أهم أسباب تسوس الأسنان، خصوصًا إذا كانت هذه الوجبات عبارة عن حلويات أو أطعمة سكرية.";
  String s27="حيث أن الفم  يصبح يحتوي على بكتيريا تحول السكريات والكربوهيدرات الموجودة في الأطعمة مثل الخبز الأبيض والأرز والحلويات إلى أحماض وتقوم الأحماض بالتعاون مع اللعاب بدورها بمهاجمة الطبقة الخارجية للأسنان «المينا» لتبدأ بعدها عملية التسوس ، وكلما أكثرت من تناول الوجبات الخفيفه  التي تحتوي على السكريات والكربوهيدرات وتركت بقاياها على أسنانك لفترة طويلة كلما عرضت أسنانك لاحتمالية الإصابة لمخاطر التسوس.";
  String s28="يفضل استبدال الوجبات الخفيفة مثل الحلويات والمخبوزات بأنواع من الخضراوات والفواكه الغنية بالماء مثل الخيار، والكرفس، والبطيخ لتميزها بتحريك جزيئات الطعام بعيداً عن الأسنان.";
  String s29="احرص على تفريش الأسنان مباشرة بعد تناول الأطعمة التي تحتوي على السكر المركز مثل الموز  لتتجنب تحولها إلى أحماض.";

  String res="- Grippo, J. O., Simring, M., & Schreiner, S. (2004). Attrition, abrasion, corrosion and abfraction revisited: a new perspective on tooth surface lesions. The Journal of the American Dental Association, 135(8), 1109-1118.\n\n- Isaacs, S. (1935). 'Bad Habits. International Journal of Psycho-Analysis, 16, 446-454.\n\n- Tanaka OM, Vitral RW, Tanaka GY, Guerrero AP, Camargo ES (2008). Nailbiting, or onychophagia: A special habit. Am. J. Orthod. Dentofacial Orthop., 134(2): 305-308.\n\n- Wechsler D: Incidence and significance of fingernail biting in children. Psychoanaly Rev 18:201-9, 1931.\n\n- Escobedo1 AA, Cañete R, Núñez FA (2008). Prevalence, Risk Factors and ClinicalFeatures Associated with Intestinal Parasitic Infections in Children fromSan Juan y Martínez, Pinar del Río, Cuba. West Indian Med., 57(4): 378-382.\n\n- American Academy of Sleep Medicine. Chicago: AASM; 2001. International Classification of Sleep Disorders: Diagnostic and Coding Manual.\n\n- Journal of medical case reports 4 (1), 1-3, 2010 International Journal of Eating Disorders 48 (2), 238-248, 2015.\n\n- M. L.؛ Martin, F.؛ Fichet, D. (1990-5)، [Anemia caused by iron deficiency and pagophagia. Apropos of a case].";
}

class Dis {
  String s1="1- التاج : هو الجزء الظاهر من السن في تجويف الفم له أشكال متعددة.";
  String s2="2- الجذر : هو الجزء الراسخ بقوة في العظم السنخي.";
  String s3="1- المينا: تعتبر الطبقة الأكثر صلابة ،وتغطي طبقة العاج في التاج.";
  String s4="2- العاج: أقل صلابة من المينا ويشكل الجزء الأكبر من السن حيث يوجد في التاج والجذر.";
  String s5="3- الملاط: تعتبر الطبقة الأقل صلابة ،تغطي طبقة العاج في منطقة الجذر.";
  String s6="عبارة عن نسيج لين غير صلب ،وتتكون حجرة اللب من نسيج ضام رقيق يحتوى على أوعية دموية ونهايات عصبية.";
  String s7="1- اللثة.\n2- عظم الفك ( العظم السنخي).\n3- الملاط.\n4- الأربطة الداعمة وهي نسيج ضام يربط السن بالفك.";
  String s8="أمراض اللثة : هو مصطلح عام يستخدم لوصف مرض معين يصيب اللثة والنسيج الضام الداعم والعظم السنخي الذي يثبت الأسنان في الفكين ، تعتبر أمراض اللثة أكثر الأمراض المزمنة التي تصيب اللثة والأنسجة الداعمة للأسنان وتقسم إلى التهابات اللثة والتهابات الأنسجة الداعمة.";
  String s9="1- ذات لون زهري / وردي.\n2- لا تنزف عند التفريش.\n3- ثابتة وذات مظهر كحواف السكينة.\n4- ذات ملمس منقط يشبه قشرة البرتقال.";
  String s10="حالة التهابية تصيب أنسجة اللثة بسبب البكتيريا وإفرازاتها السامة الموجودة في طبقة البلاك والتي تهاجم انسجة اللثة وتؤدي إلى التهابها. التهابات اللثة يمكن علاجها بشكل كامل ولا تسبب تحطيم الأنسجة . هناك أشكال مختلفة من التهاب اللثة تعتمد على المظهر السريري ، ومدة الإصابة ، والشدة ، والمسببات. ومع ذلك ، يعتبر الشكل المزمن لالتهاب اللثة الناتج عن البلاك هو النوع الأكثر شيوعًا.";
  String s11="هو مرض يصيب الأنسجة المحيطة ببنية السن ويحدث عندما يتطور التهاب اللثة ليصل إلى الأنسجة الداعمة مما يؤدي إلى حدوث التهاب مزمن ومدمر لهذه الأنسجة.";
  String s12="هو عبارة عن طبقة لينة معقدة التركيب يتكون بشكل رئيسي من البكتيريا وإفرازاتها السامة والتي تعتبر السبب الرئيسي لتسوس الأسنان والتهابات اللثة.";
  String s13="• Aggregatibacter actinomycetemcomitans\n• Porphyromonas gingivalis\n• Treponema denticola\n• Tannerella forsythia";
  String s14="- الجير/ التكلسات الجيرية حيث يشكل سطحاً خشناً على السن مما يزيد من تراكم البكتيريا.";
  String s15="يُعد من أكثر العوامل شيوعاً و انتشاراً، بحسب دراسات أُجريت على عدد من المدخنين فإنه يزيد من خطر ذوبان عظم الفك ويقلل من معدل ترابط اللثة ،وقد يتطورإلى فقدان السن.\nيزيد التدخين من خطر الأصابة بأمراض اللثة بمعدل\n5-20 مرة ؛ وذلك بسبب سمية مكوناته و تأثيرها المباشر على أنسجة الفم.";
  String s16="يمكن أن يكون التهاب اللثة أكثر حدة وشدة إذا كان المريض مصابا بمرض السكري ، حيث يؤدي ارتفاع نسبة السكر في الدم إلى ضعف الأوعية الدموية وتلف الأعصاب وتقليل مقاومة الجسم للبكتيريا والفطريات. لذلك ، فإن أي عدوى بدون مراقبة دقيقة لمريض السكري ، يمكن أن تتطور إلى إصابة خطيرة، بالإضافة إلى ذلك ، فإن كمية السكر العالية في لعاب المريض تساعد في تكوين وسط مناسب لتنمو البكتيريا والفطريات في الفم وتؤدي إلى تسوس الأسنان والتهاب اللثة.";
  String s17="لدى العدید من النساء فرصة تصل إلى 40 في المائة للإصابة بالتھاب اللثة وذلك بسبب التغیرات الھرمونیة التي یمر بھا الجسم في فترة الحمل حيث تعمل بعض الھرمونات على تعزیز نمو البكتیریا على اللثة وتزید من تراكم البلاك وھو السبب الرئیسي لالتهابات اللثة والتي يمكن أن تؤدي إلى مضاعفات لدى المرأة الحامل مثل الورم الحُبيبي القيحي.";
  String s18="تعود العلاقة بينهما إلى أن الأفراد المعرضون للضغط النفسي والمحاطون به هم أقل اهتمام بنظافة الفم والأسنان،أيضا فإن الضغط النفسي يؤدي إلى نقص المناعة وهذا يسبب الإصابة بأمراض اللثة.";
  String s19="• Cyclosporine: الذي يستخدم لتثبيط المناعة بعد زراعة الأعضاء.\n• Phenytoin: المستخدم في نوبات الصرع.\n• Nefidipin: المستخدم في علاج أمراض القلب والأوعية الدموية.";
  String s20="أمراض اللثة : هو مصطلح عام يستخدم لوصف مرض معين يصيب اللثة والنسيج الضام الداعم والعظم السنخي الذي يثبت الأسنان في الفكين ، تعتبر أمراض اللثة أكثر الأمراض المزمنة التي تصيب اللثة والأنسجة الداعمة للأسنان وتقسم إلى التهابات اللثة والتهابات الأنسجة الداعمة.";
  String s21="1- ذات لون زهري / وردي.\n2- لا تنزف عند التفريش.\n3- ثابتة وذات مظهر كحواف السكينة.\n4- ذات ملمس منقط يشبه قشرة البرتقال.";
  String s22="حالة التهابية تصيب أنسجة اللثة بسبب البكتيريا وإفرازاتها السامة الموجودة في طبقة البلاك والتي تهاجم انسجة اللثة وتؤدي إلى التهابها. التهابات اللثة يمكن علاجها بشكل كامل ولا تسبب تحطيم الأنسجة . هناك أشكال مختلفة من التهاب اللثة تعتمد على المظهر السريري ، ومدة الإصابة ، والشدة ، والمسببات. ومع ذلك ، يعتبر الشكل المزمن لالتهاب اللثة الناتج عن البلاك هو النوع الأكثر شيوعًا.";
  String s23="(Plaque induced gingivitis) وهو الشكل الأكثر شيوعا لالتهابات اللثه، بسبب عدم الاهتمام بنظافة الفم، وتراكم الجير، ما يؤدي لتراكم البكتيريا حول اللثة وتورمها.";
  String s24="(necrotizing ulcerative gingivitis) وهي حالة غير شائعة تحدث كعدوى بكتيرية، أو نتيجة للإجهاد النفسي الشديد، وأعراضه تتمثل في ارتفاع درجة الحرارة، وتضخم العقد الليمفاوية، والشعور بألم في الفم وزيادة إفراز اللعاب، وانبعاث رائحة كريهة من القم، ويكون العلاج بالمضادات الحيوية وتجنب التوتر النفسي.";
  String s25="(gingivitis modified by systemic factors) ترتبط هذه الأمراض الجهازية بأمراض اللثة لأنها تسهم عموما في انخفاض مقاومة الجسم للعدوى أو اختلال وظيفي في النسيج الضام للثة، مما يزيد من قابلية الأنسجة للتلف الناجم عن الإلتهاب.";
  String s26="- ذوبان وتآكل عظم الفك والذي يمكن رؤيته عن طريق صور الأشعة.\n- ظهور الفراغات بين الأسنان.\n- انحسار اللثة تراجع اللثة عن المستوى الطبيعي";
  String s27="1- العناية بنظافة الفم والأسنان عن طريق تنظيف الأسنان حيث يمنع تراكم طبقة البلاك على سطح الأسنان ويفضل استخدام فرشاة أسنان ناعمة واستبدالها كل ثلاث شهور او يمكن استخدام فرشاة أسنان كهربائية.";
  String s28="2- استعمال الخيط السني إزالة بقايا البلاك والطعام من بين الأسنان حيث إن شعيرات فرشاة لا تستطيع الوصول بين الأسنان.";
  String s29="3- استعمال غسول الفم لأنه يساعد على التقليل من كمية الجراثيم في الفم والتي تؤدي بدورها إلى نشوء طبقة البكتيريا وحدوث التهابات اللثة.";
  String s30="4- اتباع العادات الصحية قد يكون تغيير العادات اليومية والصحية مفيدا في التقليل من خطر الإصابة بالتهاب اللثة، أو من درجة حدثه وخطورته. من بين هذه العادات :";
  String s31="- التوقف عن التدخين.\n- عدم التعرض إلى ضغوطات نفسية.\n- المحافظة على نظام غذائي متوازن.\n- الامتناع عن الشد على الأسنان بقوة.\n- عمل فحص شامل للأسنان من خلال مراجعه دوريه لعيادة الأسنان كل 6 اشهر.";
  String s32="- العوامل المحلية ضمن بيئة الفم مثل وجود الترسبات الجيرية، تسرب مادة الحشوة عن مكانها.";
  String s33="-مشاكل تحدث أثناء تكون الأسنان مما يؤدي إلى زيادة تراكم بقايا الطعام والبكتيريا مثل اكتظاظ الأسنان.";
  String s34="- الإقلاع عن التدخين واستهلاك التبغ.\n- الاهتمام بنظافة الفم و الأسنان.\n- مراجعة دورية لعيادة الأسنان.";
  String s35="- تقليح الاسنان وتجويف جذور في عيادات الأسنان من قبل طبيب الأسنان أو اخصائي صحة الفم والأسنان لإزالة البلاك والتكلسات الجيرية فوق وتحت اللثة.";
  String s36="- إرشادات النظافة الفموية التي يقدمها أخصائي الأسنان للمريض لتحسين روتين نظافة الفم وتقنية التنظيف بالفرشاة في المنزل وغسول الفم ومعقمات الأسنان.";
  String s37="- وضع الأدوية الموضعية في موقع الإصابة.";
  String s38="- استخدام الأدوية إلى جانب إزالة التكلسات والبلاك.";
  String s39="يجب معالجة المواقع غير المستجيبة للعلاج غير الجراحي للثة عن طريق العلاج الجراحي مثل زراعة العظم و زراعة اللثة تليها مرحلة صيانة /متابعة اللثة.";

  String res1="1) Mehrotra, N., & Singh, S. (2021). Periodontitis. In StatPearls [Internet]. StatPearls Publishing.";
  String res2="2) Trombelli, L., Farina, R., Silva, C. O., & Tatakis, D. N. (2018). Plaque‐induced gingivitis: Cas  edefinition and diagnostic considerations. Journal of clinical periodontology, 45, S44-S67.";
  String res3="3) Balan, P., Brandt, B. W., Chong, Y. S., Crielaard, W., Wong, M. L., Lopez, V., ... & Seneviratne, C. J. (2021). Subgingival microbiota during healthy pregnancy and pregnancy gingivitis. JDR Clinical & Translational Research, 6(3), 343-351.";
  String res4="4) Kaskova, L. F., & Honcharenko, V. A. (2021). EFFECT OF THE THERAPEUTIC-PREVENTIVE COMPLEX ON THE PARAMETERS OF GLUTATHIONE SYSTEM AND GLUTATHIONE-DEPENDENT ENZYMES OF THE ORAL FLUID IN CHILDREN WITH CHRONIC CATARRHAL GINGIVITIS AND DIABETES MELLITUS. Ukrainian Dental Almanac, (1), 93-98.";
  String res5="5) Gasner, N. S., & Schure, R. S. (2020). Periodontal disease.";
  String res6="6) ALShami, A., ALHarthi, S., Binshabaib, M., & Wahi, M. (2019). Tooth Morphology Overview. In Human Teeth-Key Skills and Clinical Illustrations. IntechOpen.";
  String res7="7) Boyapati, R., Cherukuri, S. A., Bodduru, R., & Kiranmaye, A. (2021). Influence of female sex hormones in different stages of women on periodontium. Journal of Mid-life Health, 12(4), 263.";
}
