class mouth {
  String s1 =
      "هو ورم خبيث ينشأ على اللثة او تجويف الفم يعرف بأنه سرطان الخلايا الحرشفيه ويحدث عند الرجال اكثر من النساء, قد يظهر سرطان الفم على:";
  String s2 =
      "1- اللسان.\n2- الشفتين. \n3- قاع الفم (أسفل اللسان). \n4- بطانة الخدين الداخلية.\n5- اللثة. \n6- سقف الفم.\n7- الأنسجة الرخوه.";
  String s3 =
      "ولكن سرطان الفم يحدث بشكل اكبر على اللسان وفي قاع الفم (أسفل اللسان).";
  String s4 =
      "1- انتفاخ يتبعه ألم ونزيف وقلة حركة باللسان والتنميل (الخدران).\n2 -صعوبة في الكلام.\n3- صعوبة في البلع.\n4- ألم اثناء البلع.\n5- تغيير في الصوت.\n6- ألم في الأذن.";
  String s5 =
      "1- التدخين \nأن التبغ بأشكاله المختلفة منها التدخين والمضغ لها تأثير مسرطن في تجويف الفم. "
      "التدخين هو الشكل الأكثر شيوعا لتعاطي التبغ , الأشكال التي يستخدم فيها التبغ كدخان هي السجائر , السيجار , الأنابيب , الأرجيلة . ";
  String s6 = "2- الكحول\n يتسبب الكحول في الإصابة بسرطان الفم."
      "تعتبر المشروبات الكحولية مسببة للسرطان وتسبب بشكل خاص أورام تجويف الفم والبلعوم والحنجرة والمريء والكبد .";
  String s7 = "أسناننا من أكثر أعضاء أجسامنا صالبة ، وهي مغلفة بطبقة المينا"
      " التي تحتوي على الحد الاقصى لنسبة المعادن."
      " هل هذا يعني أن أسناننا غير قابلة للكسر وما هي اسباب تكسر الاسنان ؟"
      " حسنًا، الجواب ”لا “، قد تنكسر أسناننا وقد يمر بعضنا بتجربة الأسنان المكسورة .";
  String s8 =
      "هو كسر في القشرة الصلبة الخارجية للسن التي تسمى (المينا). التي تحمي اللب الداخلي الأكثر ليونة الذي يحتوي على أعصاب وأوعية دموية.";
  String s9 =
      "أصبحت إصابات الأسنان الآن قضية صحية رائدة بسبب انتشارها الكبير وتأثيرها الكبير على أنشطة الأطفال. قد يؤدي هذا إلى عدم الراحة الجسدية والألم والتأثيرات النفسية الأخرى مثل الميل إلى الابتعاد عن الضحك أو الابتسام ، مما قد يؤثر على تفاعلاتهم الاجتماعية."
      "قد تؤدي اصابه الاسنان إلى تلون أو تشوه أو خسارة محتمله للسن نفسه.";
  String s10 = "1- السقوط أثناء اللعب حساب لمزيد من الإصابات \n"
      "2- الأطفال الذين يمارسون الرياضات التي تتطلب الاحتكاك الجسدي هم أكبر خطر لإصابات الأسنان. \n"
      "3- مضغ الأطعمة الصلبة مثل (المكسرات، وحبات الفشار وغيرها من األطعمة الصلبه)."
      "\n4- استخدام الخاطئ للأسنان مثل (استخدام الاسنان كأداة لفتح عبوات المشروبات الغازي)."
      "\n5- الشد أو الضغط على الأسنان اثناء النوم."
      "\n6- حوادث السيارات سبب كبير إصابات المراهقين."
      "\n7- الأطفال الذين يعانون من سوء الأطباق النوع الثاني هم أكثر عرضة للإصابة بالأسنان."
      "\n8- الأطفال الذين يعانون من اضطرابات النوبات المزمنة مثل مرضى الصرع."
      "\n9- إساءة معاملة الأطفال.";
  String s11 =
      "وتختلف إصابات الأسنان الناتجة وتشمل من الأبسط إلى الأكثر تعقيداً : ";
  String s12 = "• ارتجاج السن (Concussion-A)."
      "\n• كسر بتاج السن وقد يكون بسيطاً يشمل جزءاً من المينا أو قد يمتد ليشمل العاج واللب وأحياناً كسر لتاج السن بأكمله (E-C- detacilpmocnu dna detacilpmoc erutcarF nworC)."
      "\n• انغراس السن للداخل أو اندفاع السن خارج العظم (Intrusion or Extrusion-F-C)."
      "\n• كسر بجذر السن (Root Fracture-H)."
      "\n• سقوط السن (Avulsion-I).";
  String s13 =
      " 1- ضع ثلجا أو قطعة قماش باردة على منطقة اللثة أوالخد لتخفيف الألم والتورم ، ولكن في حالة تكشف، تعرض العصب أو لب السن ، فتجنب وضع أي شيء شديد السخونة أو البرودة بالقرب من السن حتى تراجع طبيب الأسنان."
      "\n 2- استشارة الطبيب عن إمكانية تناول مسكنات الألم التي لا تستلزم وصفة طبية."
      "\n 3-  تناول المضادات الحيوية التي يصفها الطبيب، ويجب أن تلتزم بالمدة العلاجية كاملة ولا تتوقف عن تناولها لمجرد أنك تشعر بتحسن."
      "\n 4- غسل الفم بمحلول الماء الدافئ والملح بعد الوجبات مباشرة للمساعدة في الشفاء."
      "\n 5- تناول الأطعمة الطرية التي يسهل مضغها."
      "\n 6- تجنب الأطعمة التي قد تسبب اللسع ، مثل: الأطعمة المالحة أو الحارة والفواكه الحمضية والطماطم."
      "\n 7- الإقلاع عن التدخين لأنه يبطئ الشفاء."
      "\n 8- احرص على تنظيف أسنانك برفق بالفرشاة مرتين على الأقل يوميا واستخدام الخيط مرة واحدة يوميا على الأقل.";
  String s14 =
      "- تركيب قشرة veneer. \n- تركيب طربوش او حشو العصب زراعة للأسنان .";
  String s15 = "* شطف الفم بالماء لتنظيف المنطقة براحة . "
      "\n* احتفظ بأي جزء من السن المكسور لإمكانية اعادة ربطها ."
      "\n* ضع السن المكسور في كاس من الحليب أو لعاب الشخص المهم ابقاؤه في مكان رطب ."
      "\n* في حالة حدوث نزيف ، يتم العض على قطعة شاش مبللة بماء بارد ، واستمر في الضغط حتى يتوقف النزيف و يخف الألم."
      "\n* اذهب إلى أقرب طبيب أسنان للأطفال.";
  String s16 =
      "الاختيار الأمثل هو استخدام فرشاة أسنان تكون متوسطة الخشونة Medium Bristles Tooth Brush وهذا ( في حالة عدم وجود نزيف في اللثة ) أما في حال وجود انحسار في اللثة أو نزيف في اللثة ف سيكون الافضل هو استخدام فرشاة أسنان ناعمة (Soft Bristle Tooth Brush) "
      "استخدام الفرشاة الخشنة (Hard Bristles Tooth Brush) "
      "أصبح شبه محضور لأنها يمكن أن تلحق الضرر باللثة وسطح الجذر ومينا الأسنان. كما أنه يتم تعليم المريض الـطريقة المناسبة حسب الوضع الصحي للمريض ووضع اللثة والأسنان .";
  String s17 =
      "هذه الطريقة الاعتيادية الواجب تعليمها للمرضى ممن لا يعانون من مشاكل صحية، لا يضعون تقويم الاسنان أو تركيب متحرك، والأهم أنهم لا يعانون من مشاكل باللثة.";
  String s18 =
      "* أولا: ضع الفرشاة بزاوية 45 درجة على سطح السن الأمامي يجب أن تلامس الشعيرات كلا من الأسنان واللثة."
      "\n* ثانيا: حرك الفرشاة بحركة دائرية صغيرة تهتز. "
      "\n* ثالثا: نظف السطح الداخلي للأسنان الخلفية بتحريك الفرشاة بحركة صغيرة ذهابًا وإيابًا. "
      "\n*رابعا: نظف السطح الداخلي للأسنان العلوية الأمامية بإمالة الفرشاة رأسياً باستخدام ضربات صغيرة لأعلى ولأسفل. "
      "\n*خامسا: نظف السطح الداخلي للأسنان الأمامية السفلية بإمالة الفرشاة رأسياً باستخدام ضربات صغيرة لأعلى ولأسفل. "
      "\n*سادسا: حرك الفرشاة في حركة ذهابًا وإيابًا لتنظيف أسطح القضم. ";
  String s19 =
      "*الخطوة الأولى: ضع فرشاة أسنانك بزاوية 45 درجة على لثتك ونظف الأسنان بحركة دائريه اهتزازيه حول اللثة لمده ١٠ ثوان على كل سن.\n*الخطوة الثانية: قم بتوجيهها بحيث تزيل البلاك من فوق الأقواس وسلك القوس.\n*الخطوة الثالثة: أغسل الأسطح الخارجية والداخلية والمضغية لكل سن.\n*الخطوة الرابعة: استخدم طرف الفرشاة للسطح الداخلي لأسنانك الأمامية.";
  String s20 =
      "يجب أن تغطي نصف الشعيرات اللثة والنصف الآخر يجب أن يكون على سطح السن. عن طريق القيام بحركات أفقية قصيرة وخفيفة ، تتم إزالة البلاك من فوق خط اللثة. تساعد هذه الحركات على إزالة البلاك وتنشيط اللثة. يمكن عمل مجموعات صغيرة فقط من الأسنان في كل مرة, بمجرد اكتمال المنطقة ، انتقل إلى المجموعة التالية من الأسنان.";
  String s21 =
      "هذه التقنية سهلة التعلم وتوفر تحفيزًا جيدًا للثة. في هذه التقنية ، توضع الفرشاة على مجموعة من الأسنان وتحرك في حركة دائرية 4-5 مرات لكل مجموعة أسنان. يتم الاحتفاظ بالأسنان العلوية والسفلية في وضع مغلق أثناء إجراء تقنية التنظيف بالفرشاة.";
  String s22 =
      "خيط الأسنان: هو خيط مكون من مجموعة من الخيوط الرفيعة، ويستخدم لإزالة بقايا الطعام واللويحات السنية الموجودة الاسنان، وذلك في المناطق التي يصعب على فرشاة الأسنان الوصول اليها. ";
  String s23 =
      "1. تنظيف الأسنان بفعالية عالية.\n2. حماية اللثه.\n3. توفير المال.\n4. الوقايه من امراض اخرى.\n5. منع تراكم الجير.\n6. سهل الاستخدام.";
  String s24 =
      "1. قطع قطعة من الخيط مع طول لا يقل عن 30 سم.\n2.لفة كل نهاية من الخيط في إصبع القلب من كل يد، وعقد الخيط مع أصابع الفهرس والإبهام لتحسين السيطرة.\n3.تمرير الخيط من خلال الفضاء بيناتية الأولى، مما يجعل حركة يتأرجح لتنظيف الأسنان تماما.\n( يستخدم مره يوميا ع الاقل) ";
  String s25 =
      "- نزيف اللثة. \n- حساسية اللثة. \n- ضعف مينا الأسنان، مما يجعلها عرضة للتآكل على المدى الطويل. \n- العدوى، نتيجة لدخول البكتيريا الموجودة في تجويف الفم إلى مجرى الدم عبر جروح اللثة.";
  String res =
      "_1Rivera C. Essentials of oral cancer. International journal of clinical and experimental pathology. 2015;8(9):11884.";
}

class Nice {
  String s1="الأسنان والابتسامة هي عنوان كل شخص، لذلك يبحث العديد من الأشخاص عن طرق وأساليب للحصول على أسنان جميلة، وأتاح لنا مجال طب الأسنان التجميلي الكثير من المجالات لطرق الذي تساعد على الحصول على أسنان جميلة وطب الأسنان التجميلي يعتبر من أهم أنواع الطب الذي يستخدم في علاج أمراض الأسنان والفم، للحفاظ عليهم بصحة جيدة، ويعمل علي تحسين مظهر الفم الداخلي والخارجي، فهو يساهم في ظهور الفم بشكل لائق يجذب له الأنظار..";
  String s2="• هو من وسائل طب الأسنان التجميلي، ويقصد به التغلب على مشكلة تلون الأسنان غير الطبيعي، ويختلف تلون الأسنان تبعا للأسباب المؤدية لحدوثه. والتلون نوعان؛ السطحي (الخارجي) والداخلي.";
  String s3="1. التبييض بالليزر في عيادة الأسنان هو أسرع وسائل تبييض الاسنان، حيث يتم إجراؤه في جلسة واحده ولا يحتاج إلى التخدير، ولكن هذا النوع يزيد احتمالية الإصابة بحساسية الاسنان.";
  String s4="2. القوالب المنزلية :\n- قالب مخصص : يقوم طبيب الأسنان بأخذ نموذج من الاسنان (طبعه للأسنان) ويتم تصنيع قالب مناسب بحيث لا يلامس اللثة، ويتم ارتداؤه على الأسنان لمدة ٦ ساعات وتعتمد المدة اللازمه لارتداء القالب على احتياجات الشخص وتوصيات طبيب الأسنان.\n• القالب الجاهز : يمكن شراؤه من الصيدليات، وغالبًا ما يصاحبه سائل يعمل على تسريع التبييض؛ حيث يوضع على الأسنان مباشرة قبل وضع القالب المحتوي على جل التبييض، ويأتي القالب بحجم واحد للجميع يتم ارتداؤه على الأسنان لمدة تراوح بين ٥ دقائق و٣٠ دقيقة، وللحصول على أفضل النتائج، فإنه يتم الاستمرار في استخدامه لمدة ١٠ أيام إلى ١٤ يومًا.";
  String s5="3. شرائط التبييض اللاصقة (لصقات الأسنان) : تتوفر دون وصفة طبية، وبكل مرة يتم إلصاق شريط على الأسنان مباشرة، ثم التخلص منه بعد انتهاء المدة المحددة باليوم (٣٠ دقيقة تقريبًا)، لذلك تعد وسيلة أنظف وأسهل استخدامًا من القوالب.";
  String s6="• بعض الأطعمة ذات الصبغات القوية مثل: التوت والكرز.\n• بعض المشروبات مثل: الشاي والقهوة.\n• تكون الجير والبلاك والترسبات الأخرى.\n• حدوث ضربة أو إصابة في الفم.\n• التدخين.\n• ضعف طبقة مينا الأسنان بسبب الشيخوخة.\n• بعض الأدوية مثل المضادات الحيوية.";
  String s7="• تهيج أو التهاب اللثة.\n• حساسية الأسنان.\n• ظهور بعض التقرحات في اللثة.\n• هذه الأعراض مؤقتة وغالباً ما تزول بعد نزول بعد عدة أيام، لكن اذا استمرت لفترة طويلة فتجب رؤية طبيب الأسنان. ";
  String s8="• التأثير على طبقة المينا في الأسنان مما يعمل على إضعافها، وقد يصل للحد الذي يجعل الأسنان عُرضة للإصابة بالحساسية.\n• الإصابة بحساسية اللثة والتي قد تحدث نتيجة تأثرها بالمواد المُستخدمة في عمليات التبييض.\n• قتل البكتيريا النافعة في الفم والتي تساعد في وجود توازن مع البكتيريا الضارة، مما يزيد من فرص العدوى والالتهاب بالفم. ";
  String s9="• كيف تحافظ على نتيجة التبييض بالليزر؟\nبعد عمل تبييض بالليزر تظهر لك نتائج رائعة وفورية بعد الجلسة مباشرة ولذا عليك الحفاظ على هذه النتيجة من خلال:";
  String s10="• العناية بنظافة الأسنان وتفريشها باستخدام معجون أسنان مناسب وفرشاة طبية على الأقل مرتين يومياً.\n• التقليل من شرب الشاي والقهوة والإقلاع عن التدخين.\n• يمكنك استعمال اللاصقات أو البودرة المبيضة في المنزل بعد ليزر الأسنان لتحافظ على نتائجه.";
  String s11="منذ القدم يستهوي النساء تجميل الأسنان، إذ كن يستخدمن في ذلك الذهب والفضة، ولكن هذه الموضة عفى عليها الزمن في ظل بروز التقنيات الحديثة التي طالت عالم طب الأسنان، ونتج عنها صرعات جديدة في مجال إكسسوارات الأسنان والتي تناسب أذواق السيدات. ومن هذه الصرعات تركيب الكريستال والألماس لإضافة رونق جذاب للأسنان.";
  String s12="تزيين الأسنان بالكريستال هو إجراء غير جراحي سريع وفي غاية البساطة، يتم به إضافة كريستالة واحدة لسن من الأسنان الأمامية، لإضفاء مظهر جميل وجذاب على الأسنان وخاصة أثناء الابتسامة.";
  String s13="تعد مجوهرات الاسنان واحد من أكثر أنواع الإكسسوارات إنتشارا في الأونة الأخيرة، حيث يعطي شكلا أنيقا للفتيات والنساء، وربما أصبح نوعا من أنواع لفت الإنتباه، في البرسينج يعطي شكلا مختلفا للنساء.";
  String s14="•  حساسية الأسنان المؤقتة التي يسببها الحمض.\n• في حال سوء نظافه الفم يكون هناك عرضة لتراكم البلاك ونمو مثالي لبكتيريا التسوس.\n• لا ينصح بذلك للمريض الذي يعاني من تسوس عالي حيث إن بعض حلي الأسنان تتطلب تحضير الأسنان مما يسبب عيب دائم في الأسنان وهذه المناطق معرضة للتسوس بعد ذلك.\n• التهاب اللثة وتناقص النطق.\n• يمكن أن يكون أيضًا مسارًا انسدادًا أثناء أخذ الأشعة السينية للفحص الشفوي الكامل. ";
  String s15="• يجب إخبار المريض أن الأمر قد يستغرق بضع ساعات حتى يعتاد على الجوهرة الموجودة في الفم.\n• ويحافظ على نظافة الفم الجيدة ويتجنب التفريش القاسي.\n• تجنب تناول الأطعمة اللزجة والصلبة إلى حد ما حيث قد يتم التخلص منها إذا تم تطبيق المزيد من الضغط على واجهة الترابط.\n• لذلك، يتم توجيه المريض بشأن هذه الأمور لتتوخى الحذر قبل وبعد عملية تجميل الأسنان.";
  String s23="\n• Bhatia, S., Gupta, N., Gupta, P., Arora, V., & Mehta, N. (2015). Tooth jewellery: Fashion and dentistry go hand in hand. Indian J Dent Adv, 7(4), 263-267.\n•   Buragohain, A. (2020). Tooth Jewellery–Brightening Smiles the World Over. Journal Of Applied Dental and Medical Sciences, 6, 1.\n• Korkut, B., Yanıkoğlu, F., & Günday, M. (2013). Direct composite laminate veneers: three case reports. Journal of dental research, dental clinics, dental prospects, 7(2), 105.\n• Minoux, M., & Serfaty, R. (2008). Vital tooth bleaching: Biologic adverse effects—A review. Quintessence international, 39(8).\n• Oliveira, M. T., Molina, G. O., Furtado, A., Ghizoni, J. S., & Pereira, J. R. (2013).\n• Patil, A. G. (2010). Tooth jewellery: A simple way to add sparkle to your smile. Ind J Dent Adv, 2(4), 356-58.\n• Pini, N. P., Aguiar, F. H. B., Lima, D. A. N. L., Lovadino, J. R., Terada, R. S. S., & Pascotto, R. C. (2012). Advances in dental veneers: materials, applications, and techniques. Clinical, Cosmetic and Investigational Dentistry, 4, 9.\n• - Shanbhag, R., Veena, R., Nanjannawar, G., Patil, J., Hugar, S., & Vagrali, H. (2013). Use of clinical bleaching with 35% hydrogen peroxide in esthetic improvement of fluorotic human incisors in vivo. The journal of contemporary dental practice, 14(2), 208.\n• Tomar, N., Dureja, D., Kaushik, M., & Wadhawan, A. Diagnosing and managing the prodigious gingivae with distinct etiologies–a fight for reinstating big smile from the big gum: a case series.\n• Zhang, Y., & Lawn, B. R. (2019). Evaluating dental zirconia. Dental Materials, 35(1), 15-23.";
}
