
class mouth {
    String s1 =
        "سرطان الفم :هو ورم خبيث ينشأ على اللثة او تجويف الفم يعرف بأنه سرطان الخلايا الحرشفيه ويحدث عند الرجال اكثر من النساء, قد يظهر سرطان الفم على:";
    String s2 =
        "1- اللسان.\n2- الشفتين. \n3- قاع الفم (أسفل اللسان). \n4- بطانة الخدين الداخلية.\n5- اللثة. \n6- سقف الفم.\n7- الأنسجة الرخوه.";
    String s3 =
        "ولكن سرطان الفم يحدث بشكل اكبر على اللسان وفي قاع الفم (أسفل اللسان).";
    String s4 =
        "1- انتفاخ يتبعه ألم ونزيف وقلة حركة باللسان والتنميل (الخدران).\n2 -صعوبة في الكلام.\n3- صعوبة في البلع.\n4- ألم اثناء البلع.\n5- تغيير في الصوت.\n6- ألم في الأذن.";
    String s5= "1- التدخين \nأن التبغ بأشكاله المختلفة منها التدخين والمضغ لها تأثير مسرطن في تجويف الفم. "
        "التدخين هو الشكل الأكثر شيوعا لتعاطي التبغ , الأشكال التي يستخدم فيها التبغ كدخان هي السجائر , السيجار , الأنابيب , الأرجيلة . ";
    String s6= "2- الكحول\n يتسبب الكحول في الإصابة بسرطان الفم."
        "تعتبر المشروبات الكحولية مسببة للسرطان وتسبب بشكل خاص أورام تجويف الفم والبلعوم والحنجرة والمريء والكبد .";
    String s7= "";

}

